[
  {
    "id": "1d8ssk2",
    "title": "I canceled my Spotify subscription of 6 years. ",
    "text": "No one cares, but this is after all a rant. \n\nI feel like I am listening to the same music over and over and over and over and over and over and over and over and over and over.\n\nWanna listen to 90s? Here is LUNCH by Billie Eillish 🤩✨️\n\nWanna listen to soft rock? Here is LUNCH by Billie Eillish 🤩✨️\n\nWanna listen to rap/hip hop? Here is LUNCH by Billie Eillish 🤩✨️\n\nMade for you killed Spotify for me. Spotify makes me hate my music because it keeps on playing it over and over again, everywhere. All my playlists are just the same songs over and over again. I have over 4000 liked songs and every playlist is the same. \n\n+\n\nThe algorithm feels way to advertisy. I notice that when artists are about to drop albums, suddenly I get an influx of music by that artists in my shuffles or playlists because Spotify thinks I actually want to listen to my liked songs when I search for public playlists.\n\n+\n\nPrice hike, duh. And for those who care, a price hike with a CEO who said music costs nothing to make as a way of justifying not paying artists. \n\n\n\nI will be honest too tho. If Spotify ever fixes their poop, I would come back, but until Made For You dies or is optional, I am not coming back. \n\n\nBTW, I like the LUNCH song, it's just overplayed on my Spotify playlists, that's all. I am a Billie Eilish fan lol \n\nhttps://community.spotify.com/t5/Live-Ideas/Remove-the-quot-Made-For-You-quot-public-playlists-or-at-least/idi-p/6070281\n\nI created a post, like it if you agree with me!",
    "created_utc": 1717601454.0,
    "score": 1147,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1kn1t4t",
    "title": "I pay for this service why am I getting ads, one more dumb decision and I'm canceling",
    "text": "",
    "created_utc": 1747292140.0,
    "score": 643,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1oe3rkk",
    "title": "Premium subscription I prepaid was cancelled",
    "text": "So, I had activated my subscription in India but then moved due to unforeseen circumstances. My subscription was cancelled because of the region change, as I had paid via gift card in India.",
    "created_utc": 1761227350.0,
    "score": 395,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "y3zz63",
    "title": "Spotify asked me to take a survey after I cancelled Spotify Premium the other week for Apple Music. Survey asked me if I would switch to Spotify Platinum in the \"next 30 days\". I can't find any other information online. Does this mean it's FINALLY about to happen?",
    "text": "",
    "created_utc": 1665768451.0,
    "score": 732,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1mtms2v",
    "title": "Cancelling Membership",
    "text": "I have been a big Spotify advocate and premium user for 11 years and have been a top .03% user since they started doing the yearly breakdowns. I am 12 days away from cancelling my membership and switching to Tidal. The app is so incredibly bloated with useless nonsense including AI playlists and DJ features that no one uses. (Most people who enjoy music and art are completely against AI in the arts). Not to mention the smart shuffle automatically cutting on and now the most annoying bug that the app has ever had: My shuffle will play the same queue of songs everytime I start the playlist from another song. I have a playlist of 5,000 songs from 11 years worth of using Spotify and I can not stand that it is queueing the same songs everytime I start from a new song (I often start it from a newer song that I've added and skip through). PLEASE FIX THIS SHUFFLE FEATURE OR YOU WILL LOSE A CUSTOMER. I'm also posting this into this small group because the main Spotify group is impossible to post in and I was marked as a bot in the second channel. The website community forum is also impossible to post in or to chat with anyone. Spotify got too big for it's own good.",
    "created_utc": 1755525412.0,
    "score": 155,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1arowxv",
    "title": "Just cancelled my Spotify plan and they gave me this made me laugh lol",
    "text": "",
    "created_utc": 1708028015.0,
    "score": 1434,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "197wyiz",
    "title": "My friend cancelled his subscription today because of the unavailability of lot of his favourite songs. He got this after the cancellation page which has one song is missing. The IRONY lol.",
    "text": "",
    "created_utc": 1705389334.0,
    "score": 1335,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1j61548",
    "title": "Spotify Canceling Spotify Duo ?",
    "text": "",
    "created_utc": 1741383800.0,
    "score": 320,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1dcl2t0",
    "title": "I cancelled my premium subscription and Spotify gave me this 💀🥺",
    "text": "",
    "created_utc": 1718024850.0,
    "score": 456,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1e9ya0y",
    "title": "yeah ima just cancel my spotify atp bro 🤦‍♂️",
    "text": "",
    "created_utc": 1721706753.0,
    "score": 585,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1hqa7ok",
    "title": "Why does the whole subscription change if I want to cancel? Are they hoping I'll try to wait until the last day and forget to cancel? Pretty scummy",
    "text": "",
    "created_utc": 1735632550.0,
    "score": 233,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1q0i61x",
    "title": "HOW TO CANCEL SPOTIFY SUBSCRIPTION IN 2026!?",
    "text": "I'm going crazy because there's now CANCEL BUTTON! You try the app and IT'S AN ENDLESS LOOP OF MANAGE APP TO SUBSCRIPTION WITH NO CANCEL BUTTON. You try the website and it gets you to manage subscription, and it says GO TO THE APP TO MANAGE THAT DECISION YOU MADE SPENDING MONEY..AND IT GOES TO THAT SAME LOOPHOLE OF NOT FINDING THAT CANCEL BUTTON AGAIN!!\n\nPlease tell me I'm not the only one with this issue, this should be in violation of the law.",
    "created_utc": 1767201347.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1mruehw",
    "title": "Spotify is working on the ability to mix songs",
    "text": "Jane Manchun Wong via Twitter:\n\n“Spotify is working on Mixing, a mixtape-like tool for curating how the playlist transitions between musics, down to the beat, effect, waveform, etc\n\nThis is like Apple Music’s AutoMix feature but gives the power of curation to the people”\n\nhttps://x.com/wongmjane/status/1956582771759137095?s=46",
    "created_utc": 1755348722.0,
    "score": 1843,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1pngf06",
    "title": "Spotify cancelled my plan charging me more",
    "text": "As you may know duo plan has been discontinued and is only available for users to subscribed before November 13th. \nI have been a duo user for about 4 years now.\nI checked online and it says that people who were existing duo plans can still continue their plans, however spotify decided to cancel my duo plan saying that I had some payment related issues. I updated my payment method twice and yet they cancelled my duo plan. Now I cannot use duo anymore and I have to either choose standard or family plan.\nDid spotify do this on purpose?",
    "created_utc": 1765826545.0,
    "score": 6,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1pc3mx7",
    "title": "Question about cancelling Spotify autopay",
    "text": "I've just subscribed to 3 months of premium for Rs.99 and then autopay for 199 per month \n\nThe question I have is if I cancel my autopay for premium right now, will my current premium plan for 3 months also get cancelled or will it only cancel the months after the 1st 3 months. \n\nThanks",
    "created_utc": 1764665634.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1pkis14",
    "title": "Randomly got a free month of premium when going to cancel my subscription",
    "text": "Was going to cancel my subscription because the gift card I was using to pay for it was out of money and I saw that I randomly got a free month. The gift card was never billed. Is this a bug? Will I get in trouble for not reporting it? ",
    "created_utc": 1765513699.0,
    "score": 17,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1j134dz",
    "title": "I just got premium for life for free?",
    "text": "i was trying to pay for the subscription from mobile and was trying to cancel from desktop and somehow i now got premium without any money being deducted from my account!?!? lmfao",
    "created_utc": 1740845983.0,
    "score": 3316,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1pfuchx",
    "title": "My Spotify Legacy plan got cancelled",
    "text": "So i have been using it since it since a year now and suddenly the  autopay got cancelled and  Now I am not able to select my old family plan \nWhat should I do",
    "created_utc": 1765041057.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1fakpas",
    "title": "Spotify India Cancelled my Subscription Because I am using it abroad!",
    "text": "Spotify India cancelled my subscription because I came abroad and using it here. Now they are demanding me to buy the subscription from the country I am in. What kind of bullshit is this? Why wouldn't they care about their customers? ",
    "created_utc": 1725643283.0,
    "score": 51,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1nubxsp",
    "title": "Unable to cancel Spotify premium",
    "text": "I'm trying to cancel my premium subscription and surprise surprise the only button that doesn't work is the 'Manage your subscription' button.\n\nl've tried Safari, Firefox and Chrome on iPhone, iPad, and MacBook and it's all the same.\n\nEvery other button you see on the account page takes you to another page but the 'Manage your subscription' page goes to load a page and then just refreshes the account page.\n\nHave they turned off the option to cancel!!!",
    "created_utc": 1759235579.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1p15bzt",
    "title": "I am a part of a family plan and I want to leave it, if I click “cancel subscription” will it just remove me from the family or cancel the whole subscription (I am not a plan manager)",
    "text": "It’s kinda confusing me because ",
    "created_utc": 1763552169.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1p27jfk",
    "title": "Will my family plan be cancelled from the auto renew date next month? Im from India and they've removed the family plan",
    "text": "My plan auto renews next month so when the billing date arrive will i lose my premium benefits?",
    "created_utc": 1763655892.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1n4s4xu",
    "title": "Spotify canceled my free Premium trial after ONE day",
    "text": "So I literally made a brand new Spotify account yesterday, activated the free Premium trial, and today it’s already canceled. I reached out to support and they told me:\n\n“Our system indicates that you already got that offer before and therefore you are not eligible for Premium.”\n\nExcuse me? This is a NEW account. I was using Apple Music before, I’ve never once had Spotify Premium. How can the system just decide I already used it when I didn’t?\n\nThis feels like a scam. Has anyone else had this happen?",
    "created_utc": 1756639189.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1p1agso",
    "title": "Does changing country cancels your premium",
    "text": "So, I have a spotify premium for a year paid with google cards and my payment region is Nigeria. I live in europe and what will happen if I add a european card and update region to europe, will my premium be cancelled? ",
    "created_utc": 1763565674.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1op1a7n",
    "title": "Tried to cancel but get “something went wrong” message",
    "text": "I tried doing it through the app but read that I had to do it though the browser. I tried but this message shows up, see attached. \n\nI didn’t get my membership through a third party. My Spotify app should show me the option to cancel in my account settings yet here we are, another company making it difficult to cancel a subscription. Can anyone please help me cancel?\n\n",
    "created_utc": 1762345063.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1m2dld5",
    "title": "Spotify cancelled my 90 day subscription in 4 days after activation.",
    "text": "So I had spotify premium for 90 days. Suddenly after 4 days they cancelled the subscription without reason or notice. My card still has the e mandate that I created for spotify so I have not cancelled even accidentally from my end. The customer care is useless, rude and ends the conversation immediately or tells to subscribe to a new plan again. Why should I? I had 86 days left. Has someone experienced this? Are they allowed to do that? Is there any other way to contact because the 'Contact Us' option is pretty useless.",
    "created_utc": 1752773036.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1o2uox5",
    "title": "Empty playlist after premium cancellation",
    "text": "Hi everyone!\n\nI’ve had Spotify premium for 6 or 7 years now, and about 12gb of songs downloaded. I had a little problem with my card so they cancelled the premium subscription.\n\nThe thing is, my playlists are still there, but empty of songs. If I get premium again, will they be back??\n\nThanks everyone!",
    "created_utc": 1760082424.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1o9o5xg",
    "title": "help me guys how to fix this? my Spotify subscription already cancelled, then I was shocked na nag automatic deduct sa gcash ko ang payment for 1 month, then hinayaan ko nalang I deleted my account thinking na hindi na mangyari ulit but even tho the account is already deleted nag deduct sya ulit 😭",
    "text": "",
    "created_utc": 1760767690.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1natie1",
    "title": "What will happen if I cancel my subscription of the 3 month for free offer?",
    "text": "Recently got the 3 months for free offer but I usually cancel the subscriptions for apps so I don't forget and get charged but when I was going to unsubscribeit said that the premium features will get removed, will it?",
    "created_utc": 1757252526.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1n2z03a",
    "title": "Need Help: Can't Cancel Spotify Subscription Due to UPI ID Change (India)",
    "text": "I'm stuck in a frustrating situation and hoping someone here has faced something similar.\n\nThe Problem:\nI subscribed to Spotify Premium India a while back when my UPI ID was @okaxis. Since then, I've switched to State Bank of India and my UPI ID changed to @oksbi (using Union Bank of India account).\n\nNow I want to cancel my subscription but I'm having issues because Spotify still has my old UPI ID (@okaxis) on file. I can't find any option to change the UPI ID back to match my current one, and I'm worried about payment failures or being unable to properly cancel.",
    "created_utc": 1756445411.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "11bclbc",
    "title": "If Spotify doesn’t announce Hi-Fi on March 8th, will you be canceling?",
    "text": "\n\n[View Poll](https://www.reddit.com/poll/11bclbc)",
    "created_utc": 1677301420.0,
    "score": 27,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1aemdhh",
    "title": "For those who have cancelled Spotify (or are about to), what are your reasons?",
    "text": "",
    "created_utc": 1706614502.0,
    "score": 16,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1n9maxv",
    "title": "Will my premium be downgraded to free if I cancel now?",
    "text": "So, I just got the 3 free months of premium and was going to cancel to avoid being charged, but when I go to the cancellation screen, it says I'll be downgraded to the free plan immediately. Not December 6th, which was correct considering I got 3 free months today. Will I be downgraded now if I cancel?",
    "created_utc": 1757120341.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1mu2aoa",
    "title": "My Spotify premium cancelled and is now not working.",
    "text": "\nMy spotify premium cancelled, and I've been trying to get it again, but it won't let me. It keeps saying \"payment failed\" even though I'm using another card. I've tried an incognito tab as well, and it is just not working for some reason. The card is fine, but the app is just blocking me from getting premium again 😭\n\nUpdate: The problem was fixed. In case someone has a similar issue, contact the spotify support team, and they'll send you an email to explain to them what happened. It took me a few days to get it back, but they'll most likely fix the problem.",
    "created_utc": 1755560116.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1m6y74q",
    "title": "Spotify keeps canceling our family plan after a week?",
    "text": "I have been using Spotify for about three years, and my brother for about a year. We have been paying separately, and my dad wanted to connect our accounts under the family plan. When we initially attempted this, about a week later, Spotify canceled the plan and deleted my dad's account. He contacted support, and they never responded to him. After he used a new email, the same thing happened. This has never happened with my initial plan ever. Has anyone gone through anything similar? \n\n",
    "created_utc": 1753239740.0,
    "score": 5,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1m849a4",
    "title": "Spotify premium won’t cancel",
    "text": "Please help ",
    "created_utc": 1753363256.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1nbvj3b",
    "title": "Spotify credit card charges while subscription is cancelled",
    "text": "Anyone else have this issue? ",
    "created_utc": 1757355703.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1hfjl5p",
    "title": "huh..?",
    "text": "",
    "created_utc": 1734357271.0,
    "score": 1919,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1mfe3y9",
    "title": "Can't cancel Spotify premium",
    "text": "I can no longer access my Spotify account as I do not know any of the account information, so I can't figure out how to cancel my subscription. I also can't post on the main subreddit due to lack of karma whatever that means",
    "created_utc": 1754098278.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1m7mfm2",
    "title": "With Spotify Premium, if I download all episodes of a podcast, can I save them to my device as a local file? Is it possible to lose the downloads if I cancel Premium?",
    "text": "I want to download all episodes of a podcast for offline listening so would have to get Spotify Premium. \n\nHowever, after I download all the episodes (the show has since ended), if I cancel my Premium subscription, can I not access the files anymore or can I save them to my device and keep them? \n\nOn the Spotify FAQ page it says it can be lost if: \n\n  \nYou don’t go online at least once in 30 days\n\n* You reinstall the app\n* You download to more than 5 devices **Note:** Downloads are removed from the device you’ve used least recently.\n* Your Spotify app is not up-to-date\n* Your SD card (if you have one) is not working properly\n\nIs there a way you can just keep it on your device as a local file? Thank you!",
    "created_utc": 1753307582.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1m3iuoi",
    "title": "Cancelling 'Blinkist' - Spotify podcast recommendations?",
    "text": "I am in a great routine where I listen to 1-2 Blinkist 'blinks' while gettng ready in the morning. I am looking to cancel Blinkist, but want to keep the routine.\n\nWhat are some podcasts with the same vibe?\n\n\\* Short \\~20 min episodes.\n\n\\* About productivity, habits, etc.\n\n\\* Available on Spotify.",
    "created_utc": 1752885694.0,
    "score": 5,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1k781jr",
    "title": "So I got the three month free trial using my debit card, what happens if I don't cancel but there isnt enough money to charge?",
    "text": "Google is saying I'll basically get an extra free month in which I have to pay but after that I move back to normal, just want to confirm doing this and getting 4 months free wont put my account at risk of anything right? Otherwise I could just cancel the day before but if it allows me to get an extra free month I'm not complaining",
    "created_utc": 1745541585.0,
    "score": 4,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1jwtvaw",
    "title": "ACCOUNT CANCEL PREMIUM WITH NO REASON",
    "text": "I have account spotify india acc premium\nThey canceled premium with no reason,now i dont know how to solve problem ",
    "created_utc": 1744388427.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1ls8mzu",
    "title": "Cancel payments to old account?",
    "text": "Hi y’all! I recently went through a breakup and I was paying for my gf’s Spotify account. I want to cancel it but I don’t have her login info and I can’t get it. Anyone know how to make this happen aside from cancelling my card?",
    "created_utc": 1751718105.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1q5a04p",
    "title": "There’s no reason for a song to have 3 duplicates. I saved this song 3 seperate times thinking I never had it saved 😭",
    "text": "",
    "created_utc": 1767677241.0,
    "score": 721,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1kymyn0",
    "title": "I can't cancel my premium subscription",
    "text": "My gmail I used on my old spotify got deleted and my spotify account along with it, unfortunately my subscription didn't get canceled alongside it and it's still charging me. The only device still logged on somehow is my roku TV but I can't seem to cancel it from there, is there another way to cancel it?",
    "created_utc": 1748554599.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1j3zoar",
    "title": "Got my account deducted when I have cancelled my premium subscription about a month ago, what to do???",
    "text": "So i just checked my gcash account and for some reason i lost 149 pesos mysteriously so i checked my transaction history and there the latest transaction was titled \"Online payment - auto debit\" and clicked on it, and it says its a payment to \"SPOTIFY AB\" then some details. And the worst part is that my spotify account was not even upgraded to premium since ive cancelled it already. What to do and could I still get my money back??",
    "created_utc": 1741168654.0,
    "score": 4,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1bzjigd",
    "title": "Here it comes",
    "text": "",
    "created_utc": 1712637485.0,
    "score": 980,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1hhy6lp",
    "title": "My Spotify was hacked and I can’t cancel my membership ",
    "text": "Last night at 1AM my email and Spotify account were hacked. Whoever hacked me changed my email password and my Spotify password. I contacted Spotify support but didn’t get much help so I decided I would just cancel my premium and make a new account with Apple Music instead, only problem is that the only way I can cancel my premium is through the account I can’t get into. I contacted my bank and asked if they could cancel the subscription but there was nothing they could do and now I’m stuck paying for a hacker’s premium. Has anyone else dealt with this and have any idea on what I could do?? I’m currently trying to get back into my email but that will take 48 hours.",
    "created_utc": 1734629508.0,
    "score": 33,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1kavanq",
    "title": "Post free trial/cancellation deals?",
    "text": "Will Spotify offer a deal of some kind if I cancel?",
    "created_utc": 1745951575.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "cancel"
  },
  {
    "id": "1d8ssk2",
    "title": "I canceled my Spotify subscription of 6 years. ",
    "text": "No one cares, but this is after all a rant. \n\nI feel like I am listening to the same music over and over and over and over and over and over and over and over and over and over.\n\nWanna listen to 90s? Here is LUNCH by Billie Eillish 🤩✨️\n\nWanna listen to soft rock? Here is LUNCH by Billie Eillish 🤩✨️\n\nWanna listen to rap/hip hop? Here is LUNCH by Billie Eillish 🤩✨️\n\nMade for you killed Spotify for me. Spotify makes me hate my music because it keeps on playing it over and over again, everywhere. All my playlists are just the same songs over and over again. I have over 4000 liked songs and every playlist is the same. \n\n+\n\nThe algorithm feels way to advertisy. I notice that when artists are about to drop albums, suddenly I get an influx of music by that artists in my shuffles or playlists because Spotify thinks I actually want to listen to my liked songs when I search for public playlists.\n\n+\n\nPrice hike, duh. And for those who care, a price hike with a CEO who said music costs nothing to make as a way of justifying not paying artists. \n\n\n\nI will be honest too tho. If Spotify ever fixes their poop, I would come back, but until Made For You dies or is optional, I am not coming back. \n\n\nBTW, I like the LUNCH song, it's just overplayed on my Spotify playlists, that's all. I am a Billie Eilish fan lol \n\nhttps://community.spotify.com/t5/Live-Ideas/Remove-the-quot-Made-For-You-quot-public-playlists-or-at-least/idi-p/6070281\n\nI created a post, like it if you agree with me!",
    "created_utc": 1717601454.0,
    "score": 1145,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1mhbj1r",
    "title": "Upcoming Changes to Spotify Premium Subscriptions",
    "text": "https://newsroom.spotify.com/2025-08-04/upcoming-changes-to-spotify-premium-subscriptions/\n\nTLDR: Price hike in South Asia, the Middle East, Africa, Europe, Latin America, and the Asia-Pacific region",
    "created_utc": 1754308984.0,
    "score": 326,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1oe3rkk",
    "title": "Premium subscription I prepaid was cancelled",
    "text": "So, I had activated my subscription in India but then moved due to unforeseen circumstances. My subscription was cancelled because of the region change, as I had paid via gift card in India.",
    "created_utc": 1761227350.0,
    "score": 396,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1m7ekee",
    "title": "Whoever came up with “limited hours of audiobook listening” in a premium subscription model should be studied as a villain of modern capitalism.",
    "text": "Seriously — imagine paying for premium access, only to be told: “You’ve listened enough this month. Come back later or pay even more.”\nThis isn’t Netflix. This isn’t a data plan. This is books. The entire point of audiobooks is immersion, binge-listening, learning — losing yourself in stories or knowledge for hours. That’s the product. \nI am considering canceling my plan all together.",
    "created_utc": 1753289635.0,
    "score": 366,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1ayni9r",
    "title": "Spotify HiFi is still MIA after three years, and now so is my subscription",
    "text": "",
    "created_utc": 1708755236.0,
    "score": 432,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "197wyiz",
    "title": "My friend cancelled his subscription today because of the unavailability of lot of his favourite songs. He got this after the cancellation page which has one song is missing. The IRONY lol.",
    "text": "",
    "created_utc": 1705389334.0,
    "score": 1335,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1dde286",
    "title": "Spotify to Introduce More Expensive Subscription Tier for Music Lovers",
    "text": "",
    "created_utc": 1718112322.0,
    "score": 184,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1mkm2iy",
    "title": "Increased Subscription Price",
    "text": "yet still no lossless 😬🫤",
    "created_utc": 1754628373.0,
    "score": 140,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1dcl2t0",
    "title": "I cancelled my premium subscription and Spotify gave me this 💀🥺",
    "text": "",
    "created_utc": 1718024850.0,
    "score": 452,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1kc9bbj",
    "title": "'Our existing subscriptions are plenty enough for us': Spotify CEO seems to pour water on 'Superfan' subscription arriving any time soon",
    "text": "We are never getting HiFi. 🙁 ",
    "created_utc": 1746107684.0,
    "score": 288,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1owi29z",
    "title": "In light of the recent news regarding the new Platinum Premium subscription...",
    "text": "Spotify is probably the greediest, most mismanaged company I have ever had the displeasure of knowing in a while. Spotify Platinum is their way of saying that they expect their paying user base to fork out more and more money every six months to get access to CD quality, a barebones feature that should have been implemented years ago, which, let me remind you, isn't even truly CD quality because Spotify couldn't be bothered to engineer an exclusive APO mode into their app.\n\nNot only that, but they're locking playlist mixing and DJ software implementation behind this ridiculous paywall. As a part-time DJ and student, I'm baffled.\n\nBut at least I get an AI DJ... Oh, but wait, no, I don't, because even after years of this feature (that nobody really asked for and that doesn't even work that well) being a thing, I still can't access it because of Spotify's brain-dead decision to release features through A/B testing or simply just region-locking features for no apparent reason.\n\nSo not only am I paying more for features that every other music streaming service has provided for god knows how long at this point, but you're telling me that I still won't even be able to access select features because I live in \"X\" country?\n\nHow can they expect us to take this company seriously if their moves are so anti-consumerist?\n\nI'm so angry and perplexed. This app could literally be the best thing since bread, but Spotify has time and time again shown that they care more about the shareholders and fucking the listener/artists over. I'm sooo close to just throwing out literal years of accumulated playlists I personally curated just so that I don't give a cent to these absolute devils anymore.",
    "created_utc": 1763080490.0,
    "score": 47,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1n83tks",
    "title": "Overpriced subscription",
    "text": "Hey I use Spotify premium and pretty much I don’t have any of the new features no AI dj no AI playlists no mixes nothing at all..I don’t use the audiobook feature at all so that 1€ increase on my subscription seems somehow  unfair and making zero sense seriously considering switching up to Apple Music…\nThoughts? Do yall think the raise on the price seems crazy especially when you don’t have all the new features yet??",
    "created_utc": 1756971593.0,
    "score": 15,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1hqa7ok",
    "title": "Why does the whole subscription change if I want to cancel? Are they hoping I'll try to wait until the last day and forget to cancel? Pretty scummy",
    "text": "",
    "created_utc": 1735632550.0,
    "score": 234,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1ovnlkt",
    "title": "Audiobooks subscriptions are $12 for 15 hours??!",
    "text": "#That’s ABSURD!!!  \n  \nThat ain’t even long enough to listen to 2 friggin’ books! Not that I wanna stan ***AMAZON***, but at least you ain’t paying nearly $1 an hour on there. You buy (“buy”, in any event) the book, you listen to it as much and as often as you want. Why on earth would I *ever* use this Spotify nonsense??!",
    "created_utc": 1762996325.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1q0i61x",
    "title": "HOW TO CANCEL SPOTIFY SUBSCRIPTION IN 2026!?",
    "text": "I'm going crazy because there's now CANCEL BUTTON! You try the app and IT'S AN ENDLESS LOOP OF MANAGE APP TO SUBSCRIPTION WITH NO CANCEL BUTTON. You try the website and it gets you to manage subscription, and it says GO TO THE APP TO MANAGE THAT DECISION YOU MADE SPENDING MONEY..AND IT GOES TO THAT SAME LOOPHOLE OF NOT FINDING THAT CANCEL BUTTON AGAIN!!\n\nPlease tell me I'm not the only one with this issue, this should be in violation of the law.",
    "created_utc": 1767201347.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1p14z88",
    "title": "You have to buy a 3 account subscription to get uncompressed quality in India",
    "text": "I mean this is the weirdest marketing decision I've ever seen",
    "created_utc": 1763551023.0,
    "score": 14,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "14eaedj",
    "title": "Spotify’s long-anticipated HiFi tier might require a more expensive subscription - The Verge",
    "text": "",
    "created_utc": 1687265689.0,
    "score": 167,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1mrdeaj",
    "title": "What's the point of the premium icon below when i a premium subscription already?",
    "text": "",
    "created_utc": 1755298951.0,
    "score": 52,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1pkis14",
    "title": "Randomly got a free month of premium when going to cancel my subscription",
    "text": "Was going to cancel my subscription because the gift card I was using to pay for it was out of money and I saw that I randomly got a free month. The gift card was never billed. Is this a bug? Will I get in trouble for not reporting it? ",
    "created_utc": 1765513699.0,
    "score": 16,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1q35zhj",
    "title": "The download is available without a premium subscription",
    "text": "I'm from Russia, and I just created an account with a vpn today. I didn't buy a subscription, and I didn't connect the trial period, but I can download it safely on my laptop and on my phone. However, other premium features are not available. I'm wondering if anyone has encountered something like this.\n\nhttps://preview.redd.it/36r32qvn77bg1.jpg?width=1080&format=pjpg&auto=webp&s=650a67a528b72563d5ababb70071e34b571c0e16\n\n",
    "created_utc": 1767474009.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1poywz4",
    "title": "Spotify Subscription Renew",
    "text": "My 3 months premium expired today and instead of cancelling it I let it happen as I knew I don't have enough play credits nor have I added a card. Spotify mailed me about payment declination and told to pay by 16 Jan to avoid losing Premium. Isn't it a free month for me even though its a grace period.I can still enjoy Premium a month more. And In Spotify app it shows my payment will renew on 01/01/70. This date can be a glitch but what about a month more of subscription?? Is there a catch in this? Am I missing something?",
    "created_utc": 1765984184.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1j134dz",
    "title": "I just got premium for life for free?",
    "text": "i was trying to pay for the subscription from mobile and was trying to cancel from desktop and somehow i now got premium without any money being deducted from my account!?!? lmfao",
    "created_utc": 1740845983.0,
    "score": 3317,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1c59dwz",
    "title": "Spotify planning to launch Music Pro subscription with lossless",
    "text": "",
    "created_utc": 1713249575.0,
    "score": 105,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1p9c74a",
    "title": "Ok, they're taking the subscribers for granted.",
    "text": "",
    "created_utc": 1764380162.0,
    "score": 580,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1ox7mvw",
    "title": "On the Individual Premium subscription level, suddenly getting ads between podcasts",
    "text": "Is this happening to anyone else? I know a lot of pods have baked-in ads (no issue with that as it's not something I can fix) but why am I getting Spotify ads between episodes? I have the highest tier of subscription (I double checked)",
    "created_utc": 1763152176.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1fakpas",
    "title": "Spotify India Cancelled my Subscription Because I am using it abroad!",
    "text": "Spotify India cancelled my subscription because I came abroad and using it here. Now they are demanding me to buy the subscription from the country I am in. What kind of bullshit is this? Why wouldn't they care about their customers? ",
    "created_utc": 1725643283.0,
    "score": 50,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1o4tpwb",
    "title": "my spotify+hulu subscription lapsed will i still be able to use hulu after turning it back on?",
    "text": "I had the Spotify Hulu bundle when I was a student and it switched to premium with Hulu after 4 years. I lapsed on last months payment a few days ago and it says my premium is paused but that I haven’t technically cancelled premium so in order to use any Spotify services at all I have to make a payment or manually cancel my premium subscription. I have the means to pay now but will I still have Hulu if I make the payment or will it no longer be there?",
    "created_utc": 1760286912.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1p29cdw",
    "title": "I (from Germany) would like to give someone in Colombia a one-year subscription to Spotify Premium. Is that possible?",
    "text": "Title",
    "created_utc": 1763659915.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1p15bzt",
    "title": "I am a part of a family plan and I want to leave it, if I click “cancel subscription” will it just remove me from the family or cancel the whole subscription (I am not a plan manager)",
    "text": "It’s kinda confusing me because ",
    "created_utc": 1763552169.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1p695hc",
    "title": "Subscription",
    "text": "I subscribe 2 months for 169 PHP last month October 25, 2025, it supposedly last until December 25, 2025 but today  November 25, 2025 it ends pls can somebody help me fix this issue i don't wanna waste my money i already do the support thing and i email them",
    "created_utc": 1764066797.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1ngayq4",
    "title": "did the amount of titles available for free with the base subscription decrease or something?",
    "text": "A year ago I was listening to a book, and I decided I wanted to keep listening to it so I went back to go read it. suddenly I have to pay $30+ for it to be able to listen???? I looked back through the catalog and I couldn't find a single free title. is this a recent change orrr have I just been out of the loop\n\nEdit: I forgot to say this was about audiobooks in the title. oops. sorry guys",
    "created_utc": 1757803351.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1fqkijq",
    "title": "They need to have a yearly subscription, ",
    "text": "Spotify need to have a yearly annual subscription, They need to have a yearly subscription, I believe that Spotify premium should have users a yearly subscription, along side monthly subscription,",
    "created_utc": 1727432701.0,
    "score": 65,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1ociscc",
    "title": "If lend my subscription now, will I still view my Spotify Wrapped this year?",
    "text": "Not sure how that works but I want to stop paying for premium. If I do, will I still see my wrapped for this year? Do non premium users get one?",
    "created_utc": 1761066781.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1m2dld5",
    "title": "Spotify cancelled my 90 day subscription in 4 days after activation.",
    "text": "So I had spotify premium for 90 days. Suddenly after 4 days they cancelled the subscription without reason or notice. My card still has the e mandate that I created for spotify so I have not cancelled even accidentally from my end. The customer care is useless, rude and ends the conversation immediately or tells to subscribe to a new plan again. Why should I? I had 86 days left. Has someone experienced this? Are they allowed to do that? Is there any other way to contact because the 'Contact Us' option is pretty useless.",
    "created_utc": 1752773036.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1o4pxu6",
    "title": "combining two months free with a gift subscription",
    "text": "hi there,   \nI got the gift of a three-month subscription to Premium. However, Spotify is also offering me a two month trial of premium free. The free trial requires enterning payment details, and doesn't seem to allow for a gift PIN. \n\nShould I:   \n(a) ignore the free trial, and just go for the three-month subscription (losing a little)  \nor  \n(b) take the free trial, cancel after two months and then activate the gift subscription?\n\n",
    "created_utc": 1760277928.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1ostrwy",
    "title": "This is a joke, right?",
    "text": "",
    "created_utc": 1762719987.0,
    "score": 587,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1o9o5xg",
    "title": "help me guys how to fix this? my Spotify subscription already cancelled, then I was shocked na nag automatic deduct sa gcash ko ang payment for 1 month, then hinayaan ko nalang I deleted my account thinking na hindi na mangyari ulit but even tho the account is already deleted nag deduct sya ulit 😭",
    "text": "",
    "created_utc": 1760767690.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1n1li8w",
    "title": "Subscription Fee Issues",
    "text": "So I accidentally had my card locked the last time Spotify's monthly subscription fee was attempted to be withdrawn from my account. When this has happened in the past, I've gone into my account, updated my card info, and then the monthly fee would be successfully charged. This time, I updated my info, and $1.01 was charged to my account, and got a notification that in a few minutes it would fully update. After a few hours, nothing happened. I updated my card info again, and got charged another $1.01. I repeated this process 5 times and got charged the same amount every time. I continue to get notifications that Spotify was unable to collect my subscription fee. Somebody tell me what's going on and how to fix it please. ",
    "created_utc": 1756311519.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1natie1",
    "title": "What will happen if I cancel my subscription of the 3 month for free offer?",
    "text": "Recently got the 3 months for free offer but I usually cancel the subscriptions for apps so I don't forget and get charged but when I was going to unsubscribeit said that the premium features will get removed, will it?",
    "created_utc": 1757252526.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1nnsk5l",
    "title": "Can anyone tell me that why after subscription price hike I'm still getting charged with old price? Is there any reason behind it?",
    "text": "",
    "created_utc": 1758561500.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1n2z03a",
    "title": "Need Help: Can't Cancel Spotify Subscription Due to UPI ID Change (India)",
    "text": "I'm stuck in a frustrating situation and hoping someone here has faced something similar.\n\nThe Problem:\nI subscribed to Spotify Premium India a while back when my UPI ID was @okaxis. Since then, I've switched to State Bank of India and my UPI ID changed to @oksbi (using Union Bank of India account).\n\nNow I want to cancel my subscription but I'm having issues because Spotify still has my old UPI ID (@okaxis) on file. I can't find any option to change the UPI ID back to match my current one, and I'm worried about payment failures or being unable to properly cancel.",
    "created_utc": 1756445411.0,
    "score": 4,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1ksbj4x",
    "title": "Spotify says Premium subscriptions have already spiked thanks to App Store changes",
    "text": "“In the two weeks since Spotify updated its iOS app in accordance with the 2025 Order, the rate of conversions from the Free- to Premium-tier service has remained relatively constant on Android, while conversion among iOS users has increased substantially. This strongly suggests that the increase is due to Apple finally complying with the Injunction thanks to the 2025 Order.”",
    "created_utc": 1747867744.0,
    "score": 31,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1nbvj3b",
    "title": "Spotify credit card charges while subscription is cancelled",
    "text": "Anyone else have this issue? ",
    "created_utc": 1757355703.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1k1my2n",
    "title": "how do i turn off smart shuffle after my premium subscription ran out",
    "text": "",
    "created_utc": 1744921935.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1m51ww1",
    "title": "Need help with the duo subscription",
    "text": "We literally live in the same city and was already using the duo subscription. We ignored our payment so we have to purchase the subscription again. After paying for the subscription the invite link is taking me to this webpage. And they didn't even asked for my location(I remembered we put the same address) but their isn't any block to fill.",
    "created_utc": 1753050156.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1mi6hts",
    "title": "Cant change to a Premium subscription - Country mismatch",
    "text": "Due to a blocking of the old card with which I made payments of the premium subscription, I had to wait for another card. The problem is that the new card came after many failed tries of automatic payment, which eventually led to the Premium subscription being cancelled (I had no other card at that point). Now I have the new card but each time I try, it’s not letting me due to the fact that ”The card doesnt match the country”. But it does (Country: Kosovo). I already discussed with the bank, it should work. I have tried every possible way, trying different browsers, deleting cache and history and cookies, trying with mobile data, fixing my Ip to match the country, trying different devices etc. Everything but VPN (i was told it doesn’t work). Even Spotify support couldn’t help, after maybe 30-60 minutes of trying, eventually they gave up and told me to try again after 24h. I tried this 3 different times. \n\nSo, anyone else has had this experience and what did u do to fix it?\nThanks. ",
    "created_utc": 1754392956.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1lqmcdv",
    "title": "Artist payouts on Spotify vs Amazon Music: is the difference real, or just a question of subscription tiers?",
    "text": "I've been looking seriously into the whole debate about artist payouts across different music streaming platforms, trying to cut through the usual noise and get to the facts.\n\nA lot of people claim Amazon Music pays artists better than Spotify, but the reality is more nuanced. It depends entirely on the type of subscription, not just the platform itself.\n\nSpotify Premium, at its maximum quality (OGG 320 kbps), pays artists approximately $0.00318 per stream on average.  \nAmazon Music Unlimited Standard, which streams in MP3 320 kbps, pays about $0.00402 per stream.  \nSo yes, Amazon Music Unlimited pays more, but the difference is modest — roughly 25% more compared to Spotify Premium, for equivalent audio quality.\n\nBut here's the real issue: the vast majority of Amazon Music users stick with the included Amazon Prime Music tier. This plan comes with lower audio quality (256 kbps) and, more importantly, a significantly lower payout to artists, estimated at around $0.001–$0.002 per stream, which is even less than what artists earn from Spotify Premium streams, and comparable to payouts from ad-supported free tiers.\n\nThis all comes down to the well-known revenue pool system: streams from paying subscribers (Premium, Unlimited, HD) contribute to a more lucrative pool for artists, while streams from free or semi-free users (Prime Music included, Spotify Free) go into a much smaller pool, meaning lower payouts for artists.\n\nIn short, for the same audio quality, an Amazon Prime Music user actually supports artists less than a Spotify Premium subscriber, despite the claims you often read on Reddit.\n\nOf course, if you step up to the HiFi or lossless tiers (Amazon Music HD, Tidal HiFi Plus, Apple Music Lossless), the payouts per stream increase significantly — but that's a different market, with higher subscription costs and a smaller user base.\n\nSo here's my question for discussion: Will artist payouts actually improve with Spotify's upcoming HiFi tier, or are we just heading towards yet another system where only a minority of subscribers move into a higher-paying pool, without addressing the overall issue for most artists?",
    "created_utc": 1751539194.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1lxkr85",
    "title": "Indian subscription can’t login on the IOS app, region is set to india on web version. VPN is already set to india too",
    "text": "",
    "created_utc": 1752274019.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1m6gw3s",
    "title": "Spotify subscription",
    "text": "Can anyone suggest webpage where i could buy Spotify subscription from in nepal? I don't have a debit or credit card.",
    "created_utc": 1753197531.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "1jodrvz",
    "title": "Question about Spliiit subscription",
    "text": "I joined someone’s Spotify Family Premium plan through Spliiit. They emailed me, asking if I could cancel my subscription on Spliiit and send the payment directly to them at a lower price. I said I’d think about it, but they went ahead and canceled my subscription on Spliiit while still letting me keep Spotify Premium to decide.\n\nI’m not sure what to do. Can I cancel it on my end too and change my address to join another family plan? What should I do?",
    "created_utc": 1743454189.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "subscription"
  },
  {
    "id": "y3zz63",
    "title": "Spotify asked me to take a survey after I cancelled Spotify Premium the other week for Apple Music. Survey asked me if I would switch to Spotify Platinum in the \"next 30 days\". I can't find any other information online. Does this mean it's FINALLY about to happen?",
    "text": "",
    "created_utc": 1665768451.0,
    "score": 732,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1dkebb1",
    "title": "it's time to switch",
    "text": "",
    "created_utc": 1718896980.0,
    "score": 350,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1nfhpf9",
    "title": "Just switched to Spotify....",
    "text": "This is just permanently one of the first things on my home page. No option to get rid of it, as far as I can tell. It's an ai-generated and ai-voiced \"audiobook\" and it takes higher precedence on-screen than songs, playlists and updates. \n\nI remember a few years ago when Spotify was pouring so much cash into podcasts and audiobooks. This is a brand new account. This is where that investment led us? How do I get rid of this?",
    "created_utc": 1757718148.0,
    "score": 171,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1mhx2pj",
    "title": "Spotify switching from the 'Liked song heart' to the 'In Your Library check' has ruined the UI for me",
    "text": "I recently updated Spotify on my Mac for the first time in ages and have discovered that the newer versions of Spotify use a checkmark to indicate songs in your library now instead of showing a heart next to your liked songs. For me personally, this is devestating.\n\nI'm crazy and my Spotify is organized like an iTunes library. I make \"playlists\" where I just put entire albums into a playlist named that album, then sort those playlists into artist folders. For example, I have every 2Pac, Jay-Z, Mariah Carey, etc album in individual playlists, and then put all those albums (playlists) into individual artist discography folders. Because of this, essentially any Rap / R&B song you can think of is \"in my library\" in some capacity due to me having album \"playlists\" created for artists entire discographies.\n\nThis makes it extremely difficult to simply click on any random playlist or album I may have only heard once and attempt to figure out which song(s) I actually liked because everything has a check next to it.\n\nI may be speaking on deaf ears, but I would love if Spotify would resort back to the old heart icon to only show liked songs, or at least add the heart back in conjunction w/ the check to differentiate between the two.",
    "created_utc": 1754360353.0,
    "score": 175,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1odj1a1",
    "title": "Switching over because of AI recommendations",
    "text": "Today I've read about AI artists on spotify. I've been feeling my discover weekly is a bit lackluster lately, so I decided to check it out.\n\n[Here it is](https://i.postimg.cc/fWtJ5FGf/Spotify-a-FPU9clh-Od.png).\n\nOf the ones in the screenshot, the following are AI (I've been googling all of the artists):\n\n* #2 IAXMUSIC\n* #3 The King's Blues Club\n* #4 Sons of Ashes\n* #5 Old Whiskey\n* #6 Crystal Sound Studios, Art offical\n* #7 Pau-Pee\n* #9 Breaking Rust\n* #13 almost real.\n\nThis is fucking shocking to me. I don't even like blues covers of rap songs, just listened to one last week... \n\nIs Deezer currently the only one with the option to block AI generated music?",
    "created_utc": 1761163707.0,
    "score": 11,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1owb818",
    "title": "How long has this create button on/off switch been a thing?! Bless the gods I just saw it",
    "text": "",
    "created_utc": 1763063873.0,
    "score": 51,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1pg9ets",
    "title": "Should i switch to apple music?",
    "text": "Spotify has become increasingly bad in the last few years - I encounter more and more bugs, the app is slow and unresponsive, even on a brand new phone. They make unnecessary changes to the UI every other month and ruin the user experience and habituation. \n\nI'm set on attempting to switch to apple music or soundcloud, but I just wanted to ask what your experience has been. I think it's quite sad what this once amazing app has turned into. \n\nDo you recommend apple music over spotify? \n",
    "created_utc": 1765082055.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1njn204",
    "title": "I just got lossless and it's exactly what I expected",
    "text": "Grab the best pair of headphones I own (Marshall Major IV).\n\nConnect them with ~~Bluetooth~~ cable and usb-c to jack adapter to my phone.\n\nPlay a song.\n\nSwitch back and fort between lossless and very high quality.\n\nCan't hear the difference.\n\nDo the same thing on my PC.\n\nCan't hear the difference either.\n\n\n\nGuys. I'm glad for those few who have use for lossless that it finally came to Spotify. But let's stop lying to ourselves. Even on this subreddit, most of us won't hear the difference. Most of us don't even own a speaker or headphones good enough for lossless. And even if I had it, I doubt my hearing is good enough to tell the difference.\n\nWhat I'm trying to say is, don't get all riled up for something you can't even hear. It's dumb and pretentious. \n\nEdit:\n\nI think most people are missing the point. I know I won't hear the difference on Marshalls. That's not the point.\n\nThe point is, if you have good enough gear to hear it, you don't need to get riled up about this post. If you don't have good enough gear, you don't need to get riled up about lossless.",
    "created_utc": 1758137935.0,
    "score": 1035,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1k06c5i",
    "title": "Anyone deciding to switch out of Spotify? If so, why?",
    "text": "I’ve been using Spotify for years, but lately I’ve been thinking about switching. It just feels like the app hasn’t really evolved much. Wrapped is fun, but outside of that, the experience is getting kind of stale. Social features are basically nonexistent—no friend activity on mobile, and playlist collaboration is super limited. Blends are a fun social feature but consistently never used it. Music discovery is starting to feel more like a bland algorithm than something actually tailored to me. On top of that, the audio quality doesn’t seem to match what other platforms are offering these days. I’ve been thinking of trying out Tidal or Apple Music just to see if the grass is greener. Not 100% decided yet, but Spotify’s definitely losing its grip on me.\n",
    "created_utc": 1744759923.0,
    "score": 16,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1p2sq0l",
    "title": "Made permanent switch to Apple Music. Spotify lost me because of new pricing.",
    "text": "I had been using both Spotify and AM since 2016/17.\n\nFound Spotify great at music discovery, app responsiveness, social features, playlists etc. But AM is just better at lyrics, overall interface, sound quality (though lately i found AM and Spotify to have same sound quality). \n\nBut last week Spotify radically increased its prices in my country. Now Spotify costs ₹299/month ($3.37) for the high res plan.\n\nWhile Apple Music still costs only ₹99/month ($1.12). And i now have it for just ₹80/month ($0.90) thanks to apple gift card 20% cashback.\n\nSpotify for me just doesn't make sense any longer. More than 3 times the price for no special benefits.",
    "created_utc": 1763711434.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1p3ceqm",
    "title": "Does anyone have an answer to why this song has changed versions and the cover photo switches upon play? I enjoyed the other more upbeat version of this but the new one is not something I enjoy.",
    "text": "I had added the Jojo Rabbit version of Everybody’s Gotta Live, by Love, after watching the movie, now it is this slower methodical version and the other is not on Spotify. Kind of a huge let down as I was super into the song. I can find the original on YouTube but I don’t understand why it had changed.",
    "created_utc": 1763764119.0,
    "score": 12,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "16ugfzw",
    "title": "😳 this might just be where I finally make the switch to AM. It's basically the heart button with the same exact functionality, yk, the one that Spotify took away from us almost half a year ago",
    "text": "",
    "created_utc": 1695908591.0,
    "score": 139,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1pg97zc",
    "title": "I am apple music user but im thinking of switching to spotify but idk",
    "text": "Hi this is my first ever post here and I just wanted a painting from other people like I am a year-long user of Apple music cuz I used to have an iPad and used to buy music on iTunes and then when Apple music came like a year later I started to use it and I liked it I created some playlist I had some albums from artists and some some from a specific albums from certain artists and now I'm like okay I have this type of music and everything on Apple music but recently I have a lot of friends that have apple music and Spotify and both of them are like oh you should go to Spotify it's great and I was like no saying Apple music is better and I'm like very confused cuz yeah sometimes Apple music on my phone glitches and crashes and it bothers me but it works later and some of the recommendation is not the best but it's okay and I used to use Spotify like a couple years ago when I was a student for the student discount and I use it rarely cuz I used this more for the Hulu bundle but I used to use it but now I'm like questioning of switching from Apple music to Spotify and I needed someone opinion from other people to help me like decide cuz yeah I'm curious but I'm afraid that I might not like that or feel a little bit too much for me and that is something that scares me a little bit",
    "created_utc": 1765081458.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1dlzpuh",
    "title": "Spotify not allowing Premium plans to switch to basic plans",
    "text": "I just got done with a hour long chat with support. I'm trying to switch our Premium Duo plan to a Basic Family Plan so I can add our kids and opt for a plan that doesn't include audio books to save money. After an hour between two people, they told me I can't \"downgrade\" my account to a Basic Family Plan. \n\nIs anyone else dealing with this bullshit? I've been a premium subscriber for over ten years and I haven't complained even though podcasts and audiobooks have been forced on my subscription while fees continue to rise. \n\nAfter all my loyalty, this may be the breaking point.\n\nAnd they also told me there's no way to contact them via phone. I wanted to escalate my request. Does anyone know how to reach support via phonecall?",
    "created_utc": 1719074315.0,
    "score": 128,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1o0o5z5",
    "title": "Considering Switching to Apple Music - My thoughts so far",
    "text": "I'm a long long time Spotify Premium subscriber (Premium family plan for the past many years, individual before that) and am considering switching to a new platform.  Apple Music recently introduced [a feature](https://support.apple.com/en-us/118249) via SongShift that allows importing playlists from other platforms into AM.  You can use SongShift directly (and of course there are other options) but the tight integration made transitioning painless.  So I signed up for an individual AM account and am testing it before cancelling Spotify.\n\nSome very early thoughts:\n\n* Spotify desktop apps on both Windows and Mac are better. Some of this is probably muscle memory, but some things, especially on Windows (unsurprisingly, I guess) are IMO just worse.\n* The AM mobile app is on par with Spotify, in terms of polish.\n* There were quite a few songs that didn't transfer from my Spotify playlists.  I do go deep into some genres, but I *think* Spotify's library is larger.\n* The lyrics integration in AM is better.  Spotify introduced lyrics, then moved them lower, so it's harder to access.  They are front and center in AM.\n* Spotify is \\~18% more expensive for the family plans, but of course includes a pretty decent audiobook collection.  I think I'd be better off just buying the audiobooks and honestly I don't appreciate Spotify forcing me to pay for audiobooks.\n* AM is refreshingly just music.  However, I will need to find a new podcast app.  I've yet to find a podcast app that I liked, at least not since Google discontinued its app in 2024.\n* I haven't messed around enough with this yet, but I think Spotify Connect is going to be better than Apple Airplay.  I like how Spotify allows controlling different devices than the one it's playing (like I can play music from my mac and control it from my windows machine).\n* I think the Discovery stations in AM will be better than Spotify's features to find new music.\n\nBoth are pretty great.  I think generally Spotify has the edge.  However, Spotify doesn't have a standalone Apple Watch app.  That means that kids with apple watches can't stream music using Spotify.",
    "created_utc": 1759864268.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1f5je6r",
    "title": "Genuinely thinking of switching to Apple Music, wtf is this?!?!",
    "text": "",
    "created_utc": 1725096633.0,
    "score": 145,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1pli2d9",
    "title": "Why everytime I Close an app or switch to another device, my music queue resets?",
    "text": "",
    "created_utc": 1765620601.0,
    "score": 15,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1pibhxk",
    "title": "I'm in Canada and I can't switch to videos.",
    "text": "I don't see the button ",
    "created_utc": 1765296828.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1pzbd3i",
    "title": "Switching back from Apple Music, will the HomePod routine still work?",
    "text": "I’m moving from Apple Music to Spotify but I have Apple HomePods around the house where we mostly play radio stations over Siri requests. I read this would still use Apple music since a free account supports this.\nAre there any HomePod users that are happy with the Spotify life?",
    "created_utc": 1767078122.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1paifz4",
    "title": "Considering switching to Spotify",
    "text": "can i play only the tracks i added in an album instead of the whole album from my library just like on apple music? or do i have to create a separate playlist? ",
    "created_utc": 1764509750.0,
    "score": 7,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1e5ibfv",
    "title": "Switch to basic family! ",
    "text": "Don't forget to switch to basic family with the price increase if you're the account holder and not using audio books!\n\nBack to $16.99USD on basic... For now. ",
    "created_utc": 1721223215.0,
    "score": 79,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1p4hmv8",
    "title": "How do I change song without Spotify forcing me to switch device to watch a video?",
    "text": "Feels insane to ask this question...\n\nSo nowadays when I want to change song, I'm offered two choices: change the output device to my phone and watch the video, or not change the song.\n\nLike what the actual f? Every time I change song, I must start the video and song on my phone and manually switch device back to the one I'm using? Help? ",
    "created_utc": 1763886679.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "xryy3n",
    "title": "This new Spotify layout is atrocious how do I switch back to the old one pls help",
    "text": "",
    "created_utc": 1664537539.0,
    "score": 187,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1pqgysw",
    "title": "Is Spotify becoming a bit glichy in terms of switching between devices",
    "text": "The main reason I choose Spotify is how elegantly it allows me to switch between devices and control which ever devices is outputting music from any other device. Lately it seems to be a bit glichy.. Sometimes playing from more than one device at a time, or the device that is playing shows a different track from whats actually playing and that sort of thing. I also use Google cast and I'm not sure if thats interfering, but when I switch to Spotify Connect it seems equally glitchy. I have two Google TV's and I tend to control with my iphone or mac.. In the past it was perfectly seamless and smooth...\n\nAs a side note - this is probably unrelated but in case there's some sort of connect.. Spotify seems to be a bit buggy in other ways.. Like when I click an artist it will say I like 5 of their songs. But when I click through to see their songs I actually like 20.. So just a general sense of the app being less robust than before.",
    "created_utc": 1766136692.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1or5cal",
    "title": "Okay, Should i switch to a new platform?",
    "text": "I have used Spotify for about 3 years and used a couple different accounts and still have the one i made in 2024 of June. New events have made me reconsider.\n\nSayings that there is ICE Advertisements and September when We could select songs with having a free membership. Weird thing but at least they did it.\n\n2 weeks later i found out that we could only select only 5 songs a day and after that. No more unlimited skips. Absolute crap that we could not. Monthly playlists i make are on here and if i get the chance i use Tune my music or something like that to transfer old playlists to my account. I love Spotify but also what about wrapped.\n\nI want if i ever switch Something like Spotify wrapped, i can spend 5 minutes of my morning looking at it in December and being able to see how long i listened to music that year and my longest listening day.\n\nThis is still something i might do but i want recommendations if i make the switch after the Spotify wrapped, have a merry Christmas with Spotify, a great new year with Spotify, and like when \"Somewhere only we know\" By Keane got released and make the switch?",
    "created_utc": 1762547322.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1pk9zbz",
    "title": "Have DUO, want family but also switch plan manager",
    "text": "Is this possible or should we just cancel and start over? I’m plan manager on our DUO but want my spouse to be manager for the family plan.",
    "created_utc": 1765489554.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1pckfse",
    "title": "Freezing when switching songs",
    "text": "I would first like to clarify I have a 2024 Motorola Razr, if that helps.\nI have the official Spotify client from the Google Play Store and I am having an issue where it will lag almost every time a song is switched. I don't mean like lower framerate, I mean that Spotify straight up freezes completely, while still playing music.\nI have taken these steps:\n* Reinstalled Spotify \n* Cleared Cache (in app and in settings)\n* Changed the quality to as low as possible\n* Enabled data saver and disabled data saver\n* Restarted phone\n* Closed all background apps\n* Let Spotify run unrestricted (battery setting)\nAnd yet, despite everything, it will not stop freezing. I tested Spotify on another phone and it did not freeze. What do I do? Is this an issue with my phone specifically?",
    "created_utc": 1764709385.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1oxe6oj",
    "title": "Today my app decided to switch storage locations on its own?",
    "text": "Has anyone else had this happen? My Spotify app was set to my SD card and then today it decided to switch back to my phone without asking and downloaded 60gb of music completely filling my phone and killing my battery in the process. Why would it do this???\n\nIm not really sure why but every time I restart my phone the Spotify app seems to revert back to device storage",
    "created_utc": 1763168492.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1p1c86y",
    "title": "Cant switch back to list mode on desktop?",
    "text": "First pic is on the desktop app right now. Second pic is from the web player.\n\nA little while ago I switched to compact mode for my playlists to try it out. I hate it. So, today, I wanted to switch back. However, I literally cannot find the button for it. I thought I was going crazy, until I realized that the button is in plain sight on the web player. Where is the button on the app? Is it gone? Am I on a weird version?",
    "created_utc": 1763569612.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1p5d2vd",
    "title": "Spotify pauses playing when screen gets locked or switched to another app",
    "text": "Title.\n\niPhone 14pro, app is up-to-date",
    "created_utc": 1763978155.0,
    "score": 4,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1os6dc6",
    "title": "Help, podcasts keep switching to the video version every time I open Spotify",
    "text": "Every time I close and reopen the Spotify app on my iPhone and I’m listening to a podcast, it keeps switching to the video version, even though I was listening to the audio version prior to closing. Is this a bug or is Spotify trying new things to cram videos down users’ throats? Because if I wanted to watch video podcasts, I could just go to YouTube! \n\nAnyone else having this issue? If so, please tell me there is a way to disable automatic switching to video, cuz it’s getting real annoying.",
    "created_utc": 1762651541.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1p4ro1s",
    "title": "How do I remove the  \"switch to video\" button?",
    "text": "Im sorry for the Dutch language in the UI, in english its probably \"switch to video\". I was wondering if I can remove it because its in the way of an overlay im working on in OBS. Technical stuff I know.",
    "created_utc": 1763916973.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1ow3u89",
    "title": "I switched to a family plan, but they're still debiting an individual plan.",
    "text": "I've been paying for a Spotify family plan with some friends for the past 2 months. I'm not the plan administrator btw. And for these 2 months, they've been charging me for the individual plan, even though I don't use it. I was using the individual plan before, but now I'm part of the family. It's the only account I have, and in the \"My Plan\" section, it says I'm on a family plan. How can I stop being charged for something I'm not even subscribed to?",
    "created_utc": 1763047255.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1p1sb9j",
    "title": "Just switched back from AM—Siri Functionality Removed?",
    "text": "I just switched back to Spotify after using Apple Music for about a year and a half. I rely heavily on Siri when I’m driving or working, and Siri used to work perfectly with Spotify.\n\nPreviously, I could say things like:\n•\t“Hey Siri, play Michael Jackson” → Siri would start playing his top-listened-to songs.\n\n•\t“Hey Siri, play some rap/blues/K-pop” → Siri would start a radio station for that genre.\n\n•\t“Hey Siri, play a different station” → Siri would switch to something new.\n\nStarting today, Siri only plays music from my playlists or my library, and it no longer starts stations or top songs.\n\nHere’s what’s happening now:\n\n•\tIf I’m listening to Michael Jackson and say “Hey Siri, play a different station,” Siri just says “Now playing Michael Jackson” and keeps playing the same track.\n\n•\tIf I’m inside my “TWICE Essentials” playlist and say “Hey Siri, play something else,” Siri replies “Here’s TWICE Essentials” and continues the same song.\n\n•\tIf I say “Hey Siri, play <artist>” it only plays the playlist “This Is <artist>” or “ Essentials <artist>” instead of starting their top tracks or a radio station.\n\nTroubleshooting I’ve already tried:\n\n•\tApple “Intelligence” on/off\n\n•\tClearing Siri & Dictation History\n\n•\tPhone restart\n\n•\tReinstalling Spotify\n\nIs this an intentional change on Apple’s side, Spotify’s side, or a new Siri behavior?\n\nOne of the main reasons I switched back from Apple Music was because Siri there always played the least popular songs when I’d say “Siri, play .” Spotify used to fix that, but now it seems broken too.\n\nIs anyone else seeing this?",
    "created_utc": 1763608104.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1oy9evs",
    "title": "How to stop d vice switching",
    "text": "When I open my headphones case Spotify switches to the headphones.\n\nI don't want it do do this! I set it to use my Echo Dot and I don't want it to switch to my headphones. If really prefer if it never switched automatically and only explicitly.\n\n**How can I stop Spotify *helpfully* switching devices automatically?**",
    "created_utc": 1763258259.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1klkmm8",
    "title": "The more aggressive Spotify gets with switching people from the free plan to premium - more people shift to using modded version of their app..",
    "text": "Look..not everyone can afford Spotify Premium. So I don't want to hear any comments from you guys about \"Just switch to premium\" or anything like that.\n\nI am from India and there are plenty people who can't afford to pay for spotify monthly.\n\nI got Premium just because I was finally able to get some money to finally upgrade to it..But that won't last long and I will be back with the free plan soon.\n\nWhat I am trying to say if Spotify wants people to not mod their app or patch it...just make the free plan not too restrictive... I am fine with ads but putting a cap on how much songs can be skipped or played..that is just too much and just makes me angry.\n\n  \nIf Spotify really wants users to pay for the music they listen, then why do they even have a free plan? I just am really angry at Spotify for putting too much restrictions on the free plan.",
    "created_utc": 1747139228.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1oro7es",
    "title": "how do i stop spotify from changing my queue whenever i close the app and switch devices",
    "text": "lately ive been having this problem where i use spotify on my pc and whenever i close it and i use the app on my phone, it puts the last song i played regardless of the device. is there anyway to fix this?",
    "created_utc": 1762604956.0,
    "score": 5,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1o9ya6w",
    "title": "Switching to radio on account of smart shuffle badness",
    "text": "I've noticed something very frustrating with Spotify nowadays where if I pick any genre playlist, it always plays the same x songs first before getting to more variety in that playlist. If I start skipping songs to get to the variety, nowadays Spotify activates smart shuffle mode which ends up playing some subsegment of those same x songs.\n\nI've found myself increasingly listening to old school radio (i.e. on the I Heart app, etc):\n\n\\-More variety of songs\n\n\\-More variety of commercials haha\n\nAnyone else resort to the same thing?",
    "created_utc": 1760800110.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1ms2d29",
    "title": "Is there actually any chance we are getting high quality streaming anytime soon I hate how they are constantly raising the price and we don’t even get good features with the price raise I’m so close to switching to apple",
    "text": "E",
    "created_utc": 1755366526.0,
    "score": 4,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1ob6gev",
    "title": "How to switch audiobook access to a different member in a family plan?",
    "text": "So a notification pop up to switch it one day but I accidentally exited it out. ",
    "created_utc": 1760921960.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1ogar85",
    "title": "Switching between tabs on android resets the previous tab.",
    "text": "I just recently changed to android from iOS and noticed a very annoying difference between the apps. On iOS when switching between tabs, the tabs remember the page or playlist I was on. So for example if I'm viewing a playlist on the home tab and go to the playlist tab then back to the home tab it stays on what I was viewing. On android if I do this it resets the view everytime you switch from one tab to another. \n\nSomeone wrote about it on the Spotify community forum. \n\nhttps://community.spotify.com/t5/Live-Ideas/Make-Android-Tabs-retain-last-viewed-page-on-Android-like-iOS/idi-p/7166433\n\nIs this a bug or is is this how the app has always been? ",
    "created_utc": 1761450201.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1nrywmv",
    "title": "None of my playlists “automix” at all. I switched from Apple Music recently, but this feature missing makes me kinda want to go back. Does it not work for anyone else?",
    "text": "On my Apple Music playlists, everything would mix and blend together with no “quiet” between songs. On Spotify, this isn’t the case at all. I have “Automix” turned on and I have “gapless playback” on…crossfade set to 0.\n\nIs this feature not functional or something?",
    "created_utc": 1758988950.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1nei974",
    "title": "Icons switched",
    "text": "Just pointing this out",
    "created_utc": 1757619245.0,
    "score": 16,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1nm1byk",
    "title": "Why does the same song sound different when switching between iOS and watchOS?",
    "text": "When I’m about to go for a run, I’ll start playing the song I want on my iPhone, and then open Spotify on my Apple Watch, and change the source to the watch instead of the phone\n\nWhen that switch occurs, the song sounds different. Not necessarily a worse quality, but the mids highs and lows or specific instruments are more or less noticeable\n\nI do not have Lossless audio, and both cellular and WiFi sound quality are set to very high\n\nWhat’s happening there, and how can I keep them the same?",
    "created_utc": 1758382556.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1lj1shm",
    "title": "Thinking about making the switch",
    "text": "Hey,\nyesterday i finally made the switch to android again after i used an iPhone for about 12 years or so.\nNow i‘m thinking about switching my (large) apple music library to spotify and canceling my apple music subscription (and get spotify subscription)\nSo you guys/girls think this is a stupid idea?\nDid anyone of you did something similar and has some knowledge to share?\n\nThank you, have a great day.",
    "created_utc": 1750738985.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1nik0ie",
    "title": "Switching privileges on family plan",
    "text": "Can somebody tell me if there's a way to switch privileges between users on the family plan? \nI'm trying to listen to audio books but on my profile I don't have access. My wife however has access on her profile as hers is the main account. \nI'd like to switch that access to my profile if possible. \nWe've thought of me just using her profile but then id have her playlists and vice versa. ",
    "created_utc": 1758035083.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1mhnxer",
    "title": "Switch from YouTube Music Premium to Spotify",
    "text": "Anyone else switch from YouTube Music Premium to Spotify because YouTube just doesn’t work properly anymore?\nI’ve been using YT Music Premium forever, but the slow loading, crashes, and bugs have gotten so bad I just can’t deal with it anymore. I’m finally switching and was wondering how was it for you guys? Any tips or regrets?",
    "created_utc": 1754337404.0,
    "score": 6,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1mpzm0h",
    "title": "Trying to switch plan manager because I listen to audiobooks but my partner doesn’t, without losing downloads?",
    "text": "I’m hoping if I let my subscription lapse and make sure my app is closed on my phone and pc, that I can resubscribe on the same day, that my downloads will be retained. Has anyone tried this? It would be a huge hassle to redownload everything again and I am frustrated with Spotify not having a simple way to swap plan managers or even just swap who gets the included listening time. ",
    "created_utc": 1755175438.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1mybszg",
    "title": "\"Switch to video\" not showing up",
    "text": "Im a premium user and a \"video\" prompt doesn't show up at all. Songs that have music vidoes don't even say \"video\" next to them. Idk why this is happening.",
    "created_utc": 1755980137.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1n5mn76",
    "title": "Switching from pure mp3 files to streaming.",
    "text": "Hi everyone so basically I have an iphone, and  my current way of listening to music is downloading mp3 files and then adding them to apple music but not the streaming version, the mp3 player version. (I am pretty sure you can do the same in spotify using the Local files option).\n\nHowever, now as a student, I am looking forward to starting to use Spotify, specially with the ability to link accounts to different devices. However, the real problem is that I have over 2000 Mp3 songs saved on my phone (around 17GB) and I genuinely can't manually search every song and add them to my playlists. So is there any advice or tricks I could do to make my change of apps smoother and faster?",
    "created_utc": 1756727589.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "switching"
  },
  {
    "id": "1jpjk7k",
    "title": "what's stopping you from leaving spotify?",
    "text": "so i have youtube premium, which means i get yt music premium as well, but i still pay for spotify. i've tried replacing spotify with yt music, but i still couldn't do it for me  its bcz  i'm way too deep into it with all my playlists, liked songs, etc. another reason is a particular podcast that's only available on spotify , still I am now moving my podcast to yt as recently many of them have started uploading there also ..\n\n",
    "created_utc": 1743581822.0,
    "score": 154,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1m9ins5",
    "title": "Is there any way to make this jackass leave? He's been hanging around uninvited for months now.",
    "text": "The only time I have ever even viewed his profile was while trying to delete it after a month. Solo account, no one's listening to this without me, I've tried flushing it with other podcasts and playlists, nothing. I already hate the guy, but I'm a sucker for notification dots and that crazy face on the cover staring at me every time I pull up some music to chill... \n\nObviously this is a me thing, but if there is a trick to it, please let me know.",
    "created_utc": 1753498950.0,
    "score": 347,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1m6cke2",
    "title": "Spotify Premium member since 2011, planning on leaving for the first time - AI artists in my Discover Weekly",
    "text": "Absolute GARBAGE AI music appeared in my Discover Weekly today for the first time.\n\nI've read posts regarding people coming across AI music on Spotify, but for it to now be forced upon me is insane when I'm already paying a premium. \n\n[You can hear the garbage here](https://open.spotify.com/track/6UEikaSE9lvFFUIbvNJUBX?si=l2ufD-kuQJGL9HOAJ1aTQg), although I don't really want to give it more listen counts.",
    "created_utc": 1753186770.0,
    "score": 283,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1nf17py",
    "title": "I’m John, engineering manager at Spotify. I helped develop the Lossless feature. AMA!",
    "text": "Hey all!\n\nI’m John, an engineering manager at Spotify, and for the past couple of years, I’ve been a part of the team working on Spotify Lossless. It’s finally rolling out in Premium, and I’m here to do an **AMA on Friday, September 12th from 10am-11am ET** to answer your questions about how it works, what exactly it is, what to expect as it rolls out, and more.\n\nA little about me: I’ve been at Spotify for 7 years, working on the consumer UX side of things. Basically, I care HUGELY about delivering software that people will love. That’s what motivates me. Lossless has been one of the most exciting (and challenging!) projects I’ve worked on, and I’m really proud of what our team has built.\n\nSo today, ask me anything about:\n\n* How Lossless streaming works\n* Supported devices, data use, storage, or sound quality\n* The UX experience\n* And even some Lossless trivia!\n\nCan’t wait to chat and geek out about audio quality with you all 🎧\n\n \\- John, Spotify Engineering Manager\n\n\\--\n\n**Update:** Sorry all, tried to stay on a little longer but have to run now! Can I leave you with a true story that there was a moment in this project where we had a typo and launched \"ossless\" to all our team. So for a few hours, everyone internally was streaming in full \"ossless\" 🤣 Still sounded great though... In all seriousness, thank you all so much for all the questions. It was great to celebrate the launch of Lossless with you all 💚\n\nhttps://preview.redd.it/cdul1sle1qof1.jpg?width=3024&format=pjpg&auto=webp&s=70aaeb8ace2e815137b6a11ed64cd3d30dad09f9",
    "created_utc": 1757678233.0,
    "score": 1594,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1m92nf1",
    "title": "im leaving spotify man i just got an ai artist on my discover weekly spotify is doomed",
    "text": "",
    "created_utc": 1753458310.0,
    "score": 74,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "125maig",
    "title": "Can we all just leave Spotify",
    "text": "I know my customer \"support\" convo will come as a surprise to exactly no one that has ever contacted them - but dang. This is garbage. If we all just keep paying them every month nothing changes. \n\nThey don't *have* to change. But this is straight up bs. I'm sick of them making listening to music anything but joyful. Every time they make a change they chip away at my fav activity and I can't be alone in this. I want us all to go off premium in protest. Spend the time free trialing other services. I want them to feel it. \n\nWho's with me? I will know when this gets like 7 upvote ... That those 7 people like the sentiment - but come on people!!!!!",
    "created_utc": 1680091915.0,
    "score": 355,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1h0a2q2",
    "title": "app keeps showing me \"you can only use spotify abroad for 14 days\" despite not leaving the country even once",
    "text": "was playing music as usual when spotify randomly stopped working. I tried restarted the app and I couldn't access any of my playlists or play music. I tried reinstalling it and encountered this error, I have not left my country in this year at all. anyway to fix this that doesn't involve vpns?",
    "created_utc": 1732621969.0,
    "score": 43,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1nfujj8",
    "title": "Can’t get past this pop up to access my Spotify! HELP! Tried re-downloading, turning tracking on & off in settings, pressing choose just makes the pop up leave and come back up after 0.2 seconds.",
    "text": "",
    "created_utc": 1757760896.0,
    "score": 27,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1ouf71n",
    "title": "Thinking of leaving Spotify",
    "text": "Have you thought of changing services or leaving spotify due to the AI content that seems to be taking over?\n\n[View Poll](https://www.reddit.com/poll/1ouf71n)",
    "created_utc": 1762881212.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1osk5yw",
    "title": "Leaving Spotify?",
    "text": "I've been seeing posts everywhere saying everyone is switching away from Spotify? Is it true ?",
    "created_utc": 1762696997.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1nm7wxg",
    "title": "Massive Attack leaving Spotify? Honestly, I think it’s too much.",
    "text": "Here’s my take: I’m really tired of artists quitting platforms for political reasons. In just a few months I’ve lost several of my favorite bands on Spotify: King Gizzard, Deerhoof, Massive Attack, Xiu Xiu… not to mention Godspeed You! Black Emperor who pulled out completely (at least that one felt more consistent).\n\nIf they left for reasons I can actually understand — like Spotify’s miserable artist payouts, or the flood of AI-generated garbage that Spotify shamelessly pushes in playlists — I’d support that.\n\nBut refusing Israelis the right to listen to Massive Attack? As if the average Israeli listener was responsible for the war. Many Israelis are actually protesting against what’s happening in Gaza. To me, that feels completely unfair.\n\nI’m just fed up with bands mixing politics into this to the point where it punishes fans. I listen to them for the art, not for political stances that end up restricting their own audience. Whether they’re anti- or pro-Israel, anti-drone or whatever — it’s not what I’m here for.\n\nOne of my all-time favorite acts is Muslimgauze (sadly the project ended with the death of its sole member). He was provocative and politically charged too, but at least it was part of the artistic DNA, it made sense within the project.\n\nAnyway, that’s my rant. It won’t stop me from listening to Massive Attack elsewhere, but honestly… I think they’re going too far.",
    "created_utc": 1758398197.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1n17atr",
    "title": "Whos leaving spotify?",
    "text": "",
    "created_utc": 1756267953.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1nqga9g",
    "title": "Artists are leaving Spotify to protest CEO’s military AI investments - The Washington Post",
    "text": "",
    "created_utc": 1758828841.0,
    "score": 43,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1n2rrzs",
    "title": "Should I Leave Spotify? The Problem with the Streaming Exodus",
    "text": "",
    "created_utc": 1756423929.0,
    "score": 26,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1q3n4u6",
    "title": "Spotify is leaving the US market.",
    "text": "",
    "created_utc": 1767524094.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "183hijn",
    "title": "Thinking about leaving spotify, should I or should I not?",
    "text": "I've been thinking about leaving spotify for a while. I started using the app in 2018, and then started paying for the subscription late last year (because I used to use a hacked version to use spotify premium)\n\n&#x200B;\n\nEvery update just seems to get worse, and now that I'm getting into the world of Hi-Fi audio and FLACs and stuff, spotify isn't doing it for me (it's especially annoying when spotify has been saying they'll pickup Hi-Fi audio but they never do it) and also raising the price even when not having high quality audio is just gross to me.\n\n&#x200B;\n\nI've tried a trial version of TIDAL, which audio wise does the job. But the app sucks and breaks all the time, which has been a common complaint of the app so I'm definitely not using that. So I guess my choice here is Apple Music, I haven't really heard any complaints about it so idk. Ik this is weird to ask on a Spotify forum, but to anyone who has used Apple Music or is using Apple Music, what are the cons of it? Just asking.\n\n&#x200B;\n\nAnyways, thanks for reading, ik this reads more as a useless rant, which I guess it is. ",
    "created_utc": 1700910524.0,
    "score": 42,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1ohigfz",
    "title": "Dub FX leaving Spotify",
    "text": "An artist who I've been a fan of for quite a while, Dub FX, recently posted on IG that he is leaving spotify, which bums me out. He stated 2 reasons:\n\n1. Daniel Ek allegedly invested $700M in a weapons company\n2. Spotify pays $0.003 per stream, platform he's going to pays $0.022 per stream (Qobuz)\n\nAre these true? Have other artists left because of this?",
    "created_utc": 1761581086.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1pes6lq",
    "title": "Leaving Spotify - don’t want to lose Date Added information.",
    "text": "I’m leaving Spotify for ethical reasons, and I understand I can transfer playlists but it won’t move Date Added information. \n\nI find it very interesting to go back and see what I added when - can I export this info somehow, or could I just keep my Spotify Free account and see that info?\n\nThanks!",
    "created_utc": 1764932288.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1pdj1qv",
    "title": "Re-shuffling when I leave the app",
    "text": "Is the shuffle feature designed to re-shuffle the playlist every time you leave the app, or is this a bug? I'm on the road a lot for my job, so I listen to spotify in my car intermittently throughout the day. It happened several times today where I checked my queue, removed some songs I didn't want, listened while I drove, and then when I got back into my car later, I had several more songs in the queue than before. This isn't smart shuffle, either. I have that shit turned off. \n\nSo again, is this supposed to happen, or is this a bug/glitch?",
    "created_utc": 1764801960.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1p15bzt",
    "title": "I am a part of a family plan and I want to leave it, if I click “cancel subscription” will it just remove me from the family or cancel the whole subscription (I am not a plan manager)",
    "text": "It’s kinda confusing me because ",
    "created_utc": 1763552169.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1n6c43m",
    "title": "Spotify not working leaving me on a black screen.",
    "text": "This morning I woke up and relized that my spotify wasnt my alarm ringtone. I found it weird and when I went into the app the app went black and it stayed black didn't load nothing. I gave it a few hours and came back to it and still the same thing black not loading nothing. I then went ahead and tried Uninstalling it and re installing it, clearing the data for it and restarting my phone and testing it all in-between and still nothing was working. I was able to sort of sign in it asked me to login after uninstalling and re installing but then never proceed to load after asking to login in and it stuck with the same black screen. The futherst i got it to load was to the home screen with the typical defult logos but leaving nothing able to load just staying with the playlist imageing. Im jusy very lost and would like some help on what to do if anyone has some ideas. Its working just fine on my Laptop and IPad but not on my android phone. I looked it up and it doesnt seem to be a known bug or issue with everyone. Ive had Spotify for years and never had a issue with it. Im on a family plan for it for some more context. If anyone has any ideas on how to help or what to do anything is appreciated because im lost. Thank you I advance.\n\nHere's an attatched picture of how my Spotify keeps looking with the black screen and the furthest I've gotten it to load with nothing still processed to work.",
    "created_utc": 1756794294.0,
    "score": 5,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1kkrcwo",
    "title": "HOW TO LEAVE FROM THAT SHIT!",
    "text": "I was just looking through the made for you playlist and saw that apperanly, I have a blend with what might be my 3rd most hated artist of all time. Like come on! There are so many good artists that are decent human beings that listenable and you decide to make a blend with this monster?",
    "created_utc": 1747053211.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "mmtt39",
    "title": "Music pauses momentarily every time I leave the amazon app???",
    "text": "I have noticed over the last few months that when I’m listening to spotify, everything will be fine, then I’ll open the amazon app (not amazon music, just the regular degular shopping app) and as soon as I switch out of the app back to my home screen or anything else my music interrupts for a second and then continues.\n\nIt’s not a huge deal but when it happens every time it gets a little annoying.\n\nAnyone else have this experience or any ideas to make that stop happening?\n\n\n(Btw I’m on an iphone SE2020 running the latest ios and have updated since this started and it hasn’t fixed it)",
    "created_utc": 1617894397.0,
    "score": 90,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1jrtgy6",
    "title": "Does Spotify understand that making the app not usable for non premium members isn't gonna make people buy premium, it's just gonna make them leave?",
    "text": "You can't view an entire album. you cant listen to said albums or a specific song because for some reason Spotify doesnt allow to turn off shuffle so then it plays song it recommends rather than what you wanted to hear.. you can't play your own song which is honestly just weird because what if i didnt want to listen to what Spotify chose?\n\nI know this is a question asked a million times but spotify is genuinely not usable and i don't understand why its like that, you want people to see the best of your product before they decide to buy the enhanced version but frankly premium is just how an average music app should be.",
    "created_utc": 1743820750.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1n32pgm",
    "title": "Do this if you want to leave Spotify",
    "text": "",
    "created_utc": 1756459587.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1nqz5s1",
    "title": "Chicago musicians leave Spotify over concerns about data privacy and AI - Chicago Sun-Times",
    "text": "",
    "created_utc": 1758887164.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1n7i9sh",
    "title": "Spotify steals my AirPods if I leave it open on Mac",
    "text": "If I leave Spotify open on my Mac, it'll steal my AIrpods if I go off and listen to an audiobook or podcast on my iPhone in the house. I can fix it by killing Spotify on my Mac, which I forget to do all the time.\n\nSpotify, pleeeeease make a bug fix adding some code saying \"If Spotify is paused, don't auto connect to bluetooth devices\"\n\nI switched from Youtube Music months ago and find Spotify superior in every way except for this one bug that's driving me nuts.\n\nHas anyone found a better fix for this? I can't find anything in settings that's very helpful and don't want to totally kill auto switching between my devices.",
    "created_utc": 1756914144.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "11zqkv5",
    "title": "y’all can’t keep pulling this ui flip flop 💀 please pick one so i know whether to stay or leave for apple music, haven’t met one person that likes this ui",
    "text": "",
    "created_utc": 1679591129.0,
    "score": 115,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1lr4mzr",
    "title": "Annual member leaving Spotify. Can I transfer my subscription to a friend? If so, how?",
    "text": "",
    "created_utc": 1751586962.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1lfw9b5",
    "title": "help morgan wallen won’t leave me alone",
    "text": "I have had morgan wallen blocked on Spotify for years and it still plays him on my playlists!!! I just got FOUR IN A ROW!!!! how do I get this man to stop harassing me??",
    "created_utc": 1750398098.0,
    "score": 8,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1k9mw6v",
    "title": "Songs from a queue keep popping up when I don’t want and I don’t know how to leave the queue? Please help,",
    "text": "Video shows me trying to leave the queue even though it won’t work. Please help me! I’ve already tried logging out of my account and logging back in, and switching the playlist. ",
    "created_utc": 1745813604.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "sfm5v3",
    "title": "Anyone thinking about leaving spotify right now?",
    "text": "I'm considering leaving, and there are a lot of reasons why I've been thinking about it for a while--but now the issue with Neil Young has triggered me to actually seriously consider my options. It's not simply losing Spotify access to Neil Young's music (although that certainly sucks bc I'm a fan), but a lot of other aspects about spotify that I hate--including the fact that my faves (who tend to be artists with smaller fanbases) get paid next to nothing for their work. \n\n&#x200B;\n\nIs anyone else thinking about leaving for these reasons or maybe other reasons?",
    "created_utc": 1643475171.0,
    "score": 20,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1bni6jw",
    "title": "NEED HELP I HAVE A GLICH IN THE PLAYBACK SETTINGS WITH THE VOLUME LEVEL IF I CHANGE IT TO LOUD OR NORMAL RIGHT WHEN I LEAVE THE SETTING PAGE IT GOES RIGHT BACK TO QUIET HELP PLEASE",
    "text": "",
    "created_utc": 1711384683.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1h9knd1",
    "title": "Can you stop Spotify from leaving video mode?",
    "text": "When I play songs in full-screen video mode and a new song starts, it exits even though the new song has a music video. Can I avoid this? It's kind of annoying when Spotify is playing in the background.",
    "created_utc": 1733670113.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1h7ms8v",
    "title": "This is what happens when you leave the DJ in charge... ",
    "text": "Going from Fear Factory to Grupo Frontera is crazy. I never EVER listen to this kind of latin music, why would they push this crap on my DJ is beyond me. \n\nhttps://preview.redd.it/nvw8c78t345e1.png?width=1421&format=png&auto=webp&s=357f61e355046066c87d1a41056f2ab0c4fc1315\n\n",
    "created_utc": 1733440360.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1l60lhs",
    "title": "How many songs do you have in your liked songs playlist? I’ll go first. :-)",
    "text": "\n\n\n\n\n\n\n\n\n\n\n\nPS: thank you for allowing images. It’s something that I take for granted sometimes and it’s just easier to post images with questions like this.",
    "created_utc": 1749346397.0,
    "score": 95,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "15h2k31",
    "title": "when you open the heartstopper official playlist, it rains dry leaves",
    "text": "",
    "created_utc": 1691064915.0,
    "score": 28,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "17zv0vv",
    "title": "Spotify Plans to Leave Uruguay Over Change to Copyright Laws",
    "text": "\"Without clarity on the changes to music copyright laws,\" a spokesperson said, \"Spotify will unfortunately begin to phase out its service.\"",
    "created_utc": 1700504380.0,
    "score": 21,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1kov1nx",
    "title": "why would anybody need three different buttons to edit a playlist",
    "text": "these all do the same thing and i see absolutely no point. im used to clicking the three dots>edit and then they added the edit button below the playlist cover snd im like ok i guess thats fine and now the one next to the name of the playlist!??!?? whos asking for this!??!??",
    "created_utc": 1747494113.0,
    "score": 771,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "xx2fsj",
    "title": "Is there a way to leave feedback about Spotify functionality? Absolutely love the new Smart Shuffle, don't want it to be removed. Though I agree that UI/UX is not ideal.",
    "text": "",
    "created_utc": 1665054123.0,
    "score": 8,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1arowxv",
    "title": "Just cancelled my Spotify plan and they gave me this made me laugh lol",
    "text": "",
    "created_utc": 1708028015.0,
    "score": 1429,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "197wyiz",
    "title": "My friend cancelled his subscription today because of the unavailability of lot of his favourite songs. He got this after the cancellation page which has one song is missing. The IRONY lol.",
    "text": "",
    "created_utc": 1705389334.0,
    "score": 1336,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "nyri8e",
    "title": "For people having NO Internet Connection and the app taking ages to load, do you ever think about leaving for another service. I'm getting so close to leaving. Only thing that's stopping me is Spotify seems to have more DnB then other platforms and Release Radar.",
    "text": "",
    "created_utc": 1623571026.0,
    "score": 17,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "zubs9b",
    "title": "Why does Spotify now do this if I play any media in another app? Or if I close it and reopen it? Or just leave my phone and do nothing with it? Its becoming so annoying, I'm considering just finding another music app. I'm on Android (Google Pixel) if that helps any.",
    "text": "",
    "created_utc": 1671894931.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1orwd4o",
    "title": "AI-generated right-wing anti-immigrant hate songs are dominating the Dutch Spotify charts right now",
    "text": "Hi everyone,\n\nI’m writing this because I’m genuinely concerned about where things are heading, and I think it’s important that more people are aware of this.\n\nRight now in the Netherlands, we’re seeing a disturbing trend: AI-generated right-wing songs that spread hate speech against immigrants and left-wing people are climbing to the top of the charts.\n\nFor context, there’s been growing public tension in the Netherlands around AZCs (asielzoekerscentra, or asylum seeker centers). These are places where refugees and migrants stay while their asylum applications are being processed. That tension seems to be fueling this wave of AI-produced songs that promote anti-immigrant rhetoric.\n\nCurrently, one of these AI anti-immigrant songs is in the Dutch Top 5, and about 8 out of 10 songs in the viral chart are in the same hateful category. These are not real musicians; they are AI-generated tracks spreading extremist messages.\n\nWhat really worries me is that Spotify is allowing this, even as these songs go viral. How can they justify platforming AI-generated hate speech or letting AI content outcompete real artists on their charts?\n\nEdit:\n\nHere are a few of the (translated) song titles currently in the Dutch viral top 10. All of these are AI-generated and promote right-wing, anti-immigrant, or anti-left messages:\n\n•\t“Wij zeggen nee nee nee tegen een AZC” – “We say no no no to an asylum seeker center.” This refers to local protests against AZCs (asielzoekerscentra), the facilities where refugees and migrants stay while their asylum applications are being processed.\n\n•\t“Noem mij maar rechts extreem” – “Just call me far-right.” The song appears to embrace and glorify the label of being far-right, treating it as a badge of honor.\n\n•\t“Fuck jullie linkse fuckers” – “F*** you leftist f***ers.” Explicit hate speech targeting left-wing people.\n\n•\t“Timmermans valse profeet” – “Timmermans, false prophet.” This attacks Frans Timmermans, a well-known Dutch left-wing politician.\n\n•\t“Als je het niet bevalt ga dan” – “If you don’t like it, then leave.” This phrase is often used in nationalist or anti-immigrant rhetoric implying that people who disagree with right-wing views or government policies should leave the country.\n\nThese are not fringe tracks; they are all currently in the viral top 10 in the Netherlands. That’s what makes this so alarming.",
    "created_utc": 1762625747.0,
    "score": 216,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "ryvtf6",
    "title": "While I'm keeping my downloaded songs in internal memory, should I physically remove my SD card from my phone, or is it fine to leave it there?",
    "text": "",
    "created_utc": 1641633107.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1dde286",
    "title": "Spotify to Introduce More Expensive Subscription Tier for Music Lovers",
    "text": "",
    "created_utc": 1718112322.0,
    "score": 182,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "t3vm84",
    "title": "Please help, I’ve downloaded this song and it closes the song down. When I play it again it leaves me at this screen. The music is downloaded as well.",
    "text": "",
    "created_utc": 1646097951.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1i9098f",
    "title": "Spotify shuffle is a myth - so I've been developing an app to fix that",
    "text": "As we all know or have suspected Spotify's shuffle kinda sucks, and hasn't been truly random for a while. For so long I've hated that shuffling my 2000+ liked songs playlist just ends up playing the same songs I've been listening to the past couple weeks and I never hear the songs I added years ago.\n\nBecause of all that I built this tool [shuff.it](http://shuff.it), mostly for myself honestly, but am also hoping to share it with others who've faced the same annoyance. I'm finishing up development on it this week and will be releasing it soon. Check out the site if you want to be notified when it's done.\n\nHopefully this doesn't come across as an ad 😅, I genuinely want to share this tool that I've made so that people don't have to deal with Spotify's awful shuffle. The app will be free upon release.\n\n\\------\n\n\\[ UPDATE \\]\n\nAfter looking into the Spotify API's quota extension for API usage, and that application process, apparently it can take some time (weeks to months?) to be accepted.\n\nThe app itself is ready to go and functioning, but App Store/Google Play release will have to wait until that application goes through. Just figured I'd add this update since the original plan was to have the app released this past week.\n\nIf there's interest I could consider letting some early testers try it out either with the apk file or through TestFlight, but only 25 test spots would be available for Spotify's API until that quota extension goes through. Leave a comment or DM me if interested in that.\n\n\\-----\n\n\\[ UPDATE 2 - Sept 18, 2025 \\]\n\nFor anyone patiently waiting for and closely following this app, my apologies for the super long delay. Life got in the way and this project had to take the backburner for a while. Spotify also rejected my initial application for an API quota extension, only for small things so I should be able to fix those and reapply without too much issue.\n\nI hope to find some time in the coming weeks/months to revisit this app and get it actually released for testing and production use.\n\nI'll be sure to send out email updates to all those who signed up for the waiting list when it is released for testing and when it eventually is fully released.",
    "created_utc": 1737738300.0,
    "score": 347,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "13g27az",
    "title": "Can Spotify please bring back the heart?",
    "text": "I just finally got the update and I'm so pissed it's horrible, I am so sick of Spotify making ridiculous UI changes and the new desktop update makes me physically ill. I use Spotify on my laptop way less now and the heart changing pisses me off too much I might just move to Apple or Tidal or something. Can they leave things alone for just a moment?\n\nEdit: Typo",
    "created_utc": 1683938137.0,
    "score": 480,
    "subreddit": "truespotify",
    "keyword": "leaving"
  },
  {
    "id": "1pfi9vu",
    "title": "Is this yet another bug in the 'following' podcast episodes list or is it a setting?",
    "text": "All of my episodes appear \"hidden\" and with an \"Age-restricted video\" tag. The 'explicit content' option in the content settings is activated. ",
    "created_utc": 1765002024.0,
    "score": 24,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1hr8dgb",
    "title": "My Spotify is Completely Broken, and Won't Allow Me to Play Any Song. Any Known Reason for this Bug, and Any Known Fixes?",
    "text": "",
    "created_utc": 1735754550.0,
    "score": 35,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ps984j",
    "title": "Why are my liked songs bugging out on mobile? (Songs showing in liked songs on artist page) but not showing up on the album page?",
    "text": "",
    "created_utc": 1766331337.0,
    "score": 18,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1lln5io",
    "title": "I really hope this is a bug",
    "text": "While listening to music I saw that it shows that a video is available. I think this is too much. Showing it in the app is enough. I assume people will have their phones open in the app if they want to watch a music video and will specifically search for it. This feels like unnecessary information here.",
    "created_utc": 1751006668.0,
    "score": 121,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pfswf6",
    "title": "Spotify playlist bug?",
    "text": "So suddenly my playlists turned into these, which are just the names of some of the songs that I have in my playlist. This also happens when I try to play a song, it just opens another list of names and plays a random song. What should I do? I already tried to delete and reinstall. And it happens only on android. On pc its fine\n\nhttps://preview.redd.it/su35s5zpyl5g1.jpg?width=3200&format=pjpg&auto=webp&s=558b3f5b5dcc100ba4c87f123e98b1872fd11b0d\n\n",
    "created_utc": 1765037455.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ofe30o",
    "title": "Anyone else had this bug",
    "text": "I’m on mobile (IPad) and when I try to get the song to go full screen by clicking on the image the screen just goes black. I’ve deleted and reinstalled the app, turned my device on and off. Any help?",
    "created_utc": 1761352644.0,
    "score": 10,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pewsi1",
    "title": "Widget bug/no music controls (Samsung S25, premium plan)",
    "text": "I realized yesterday that my home screen widget stopped showing any music that I played, there's absolutely no controls. It just acts as a link to a playlist, but I'd like my controls back. This photo shows how it looks while simultaneously playing music on Spotify.\n\nHas anyone had this problem and how did you fix it? \n\nI tried deleting and re-inserting the widget, clearing cache, force stopping the app, but that didn't work. It flickered just a bit but then went back to that mode like in the picture. Just wondering if this is a wider bug (OR a dumb feature) that could be fixed on its own, or if I need to start the app deleting/re-downloading process or there's any other thing I could do. I'm not that tech-savvy, so idk what I should even try😅\n\nThank you in advance!\n",
    "created_utc": 1764945682.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1q3rqj1",
    "title": "The wraped tab / logo had a red outline instead of white that disappeared after re-opening the app. Any idea what this means ? Genuinely curious if it was intentional or just a bug.",
    "text": "I simply opened the app and took a screenshot of something else. While looking at the screenshot I noticed that the wraped tab had a red outline instead of the normal white one. I didn't pressed on it and I wasn't able to get it back no matter how many times I closed and opened the app again. Did this happend to anyone else ? I'm genuinely really curious if it was a bug or it actually had a meaning. ",
    "created_utc": 1767538107.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1q5rdya",
    "title": "Fix to the local file flac issue/bug",
    "text": "The solution Wraps the flac file with an alac \"wrapper\", and this makes spotify read the file correctly. the solution involves ffmpeg, so make sure you install\\\\have it, I also recommand enabeling the \"show file extentions\" in file explorer --> view.\n\nnow we're gonna use CMD for this, nothing to be scared of. at the start, write the command:\n\n    cd desktop\n\nThis navigates to the desktop in the teminal, make sure the initial file is in your desktop.\n\n1. get your file and convert it to flac, you can use ffmpeg for that, ask Gemini to make you a command for the right file format.\n\n1.1. if it's already a flac, rename the file to input (dont touch anything after the dot, the file name should be input.flac) and run this command:\n\n    ffmpeg -i input.flac -map 0:a -map 0:v? -map_metadata -1 -c copy -metadata artist=\"Artist Name\" -metadata title=\"Song Title\" -metadata album=\"Album Name\" output_fixed.flac\n\n1.2. download kid3 to edit the metadata (mp3tag causes issues).\n\n2. add or change any metadata you want with kid3, you **will not** be able to after this process, otherwise the bug will occur again.\n\n3. you have your flac file, you're gonna convert it to m4a with this command:\n\n    ffmpeg -i input.flac -c:a alac -c:v copy -map_metadata 0 -movflags +faststart output.m4a\n\n4. convert it back to flac with this command:\n\n    ffmpeg -i output.m4a -c:a flac output_rebuilt.flac\n\nAnd now, Spotify should show the artist correctly.\n\nDont edit the metadata in mp3tag, only in kid3, I've found that mp3tag causes problems.\n\nopen for questions in the comments.",
    "created_utc": 1767725741.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1j134dz",
    "title": "I just got premium for life for free?",
    "text": "i was trying to pay for the subscription from mobile and was trying to cancel from desktop and somehow i now got premium without any money being deducted from my account!?!? lmfao",
    "created_utc": 1740845983.0,
    "score": 3313,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1oi335k",
    "title": "Anyone elses spotify bugging when clicking on a song?",
    "text": "Whenever I click on a song, not to play it but to do further things with it (e.g. Loop, look at the artist, add it to a playlist) my whole screen goes black? Please say if you have experienced anything similar. ",
    "created_utc": 1761636663.0,
    "score": 9,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ozc4vl",
    "title": "bugs with adding songs to playlists",
    "text": "it often doesn't add, or just to the first playlist of the multiple ones I selected ",
    "created_utc": 1763372619.0,
    "score": 5,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1m5zlcy",
    "title": "Please tell me this is a bug and not a new thing.",
    "text": "So it now permanently shows the lyrics at the bottom with the player be scrolled more to the top, and i absolutely hate it. And from what I gathered this is just how it is now...? It's absolutely horrendous and seems like ane extremely idiotic design choice.",
    "created_utc": 1753143438.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pf65b3",
    "title": "Messages bugged?",
    "text": "I saw I had a message request from someone so i clicked “accept message request” to see what they said and it said “message request sent” I didn’t send anything? I just wanted to see what they said. Why did this happen? ",
    "created_utc": 1764967446.0,
    "score": 5,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pnalkq",
    "title": "Is this a bug or no",
    "text": "A person I used to be in a situationship with sent me a message request but Im not sure if this is a bug or he actually sent it. We’ve been no contact for 5 months now",
    "created_utc": 1765813482.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1py2gt4",
    "title": "\"On Repeat\" Playlist Bugging Out",
    "text": "The On Repeat playlist resets every three days, and before a few cycles ago, the songs on the playlist were, if not regular then predictable--if I'd been listening to a certain song a lot, I could expect it to appear on the list or shoot up the ranking when the list resets.\n\nHowever, three or four cycles ago, all of the songs changed randomly to completely new ones. They're songs I've saved to playlists but not ones I've listened to recently and certainly not repeatedly.\n\nI've tried testing it over the past week or so, specifically and frequently listening to the songs that previously populated the playlist, but the playlist reset again a few hours ago and none of those songs are on it, while all the new strange ones still are. However, those new strange songs aren't in my recent listening history.\n\nFunnily this began *after* I started a Premium trial. Definitely doesn't inspire me to pay for the service when it ends.\n\nAnyone know what's up?",
    "created_utc": 1766955901.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ho93hh",
    "title": "PSA: Known Spotify bug stops playback and next song won’t play",
    "text": "There’s a ton of posts about this every day, so posting this for awareness. Link to community post in the comments. \n\nAppears to be impacting some users across desktop, web, and mobile, both Premium and Free tiers, both queued songs and regular playback. The Now Playing bar may also switch to an inactive state (greyed out), preventing the user from playing other songs. \n\nSome users report clearing the queue solves the issue temporarily, but there’s no official fix from Spotify yet. ",
    "created_utc": 1735403065.0,
    "score": 76,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pkzdo8",
    "title": "Spotify bug help",
    "text": "So for the past year Spotify has been randomly adding whole blocks of songs to my queue even when im not listening just random artists will start playing. I've changed my password, logged out of everything and checked all the settings people say to check but it keeps happening. Like I'll be watching something on YouTube and Spotify just queues up and starts playing 50 back to back songs from an artist I'd NEVER listen to. Does anyone know how to fix this?",
    "created_utc": 1765564266.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1og66k3",
    "title": "Tablet Version Bug",
    "text": "Hey does anyone who uses Spotify on a tablet also have the issue of not being able to open the queue up or do the thing where you hit the album cover of the song that’s playing on the main menu and it pulls it up over the whole screen (not sure the actual terminology) any time I try to do anything other than skip, or select a song my whole screen goes black and I basically lose access to the app aside from the audio until I reboot the app. Very weird and very new figured I’d check.",
    "created_utc": 1761435941.0,
    "score": 10,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ppmep0",
    "title": "Release Radar playlist bug",
    "text": "I have been having a serious issue that’s driving me crazy with only the release radar playlist .\n\nThe playlist plays at random although all the shuffle buttons are put on off , I have to press every song to just play the playlist in regular order from start to finish. \n\n😩😩😩😩😩😩😩😩😩😩😩😩😩😩😩😩😩",
    "created_utc": 1766049115.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1osss9j",
    "title": "Spotify bug",
    "text": "Why is my playlist only showing previews and not the songs themselves? In my phone it's normal, but in my tablet it shows like this",
    "created_utc": 1762717657.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1po3mg8",
    "title": "Crossfade / Gapless playback bugged?",
    "text": "Hello.\n\nSorry if the title isn't correctly translated. \nI'm not native English and I don't know how the function is called in other languages. \n\nFor a few days now my songs keep skipping the last few seconds and the next one jumps the first seconds as well. \nIt's not just fading in and out, it's always like 20 seconds on both ends and that results in Spotify being unusable for me. \nIt first happened in downloaded playlists but I thought okay, maybe because I was in offline mode and fell asleep on plane, with phone in handy I must have changed settings by accident (I often have my phone unlocked in hands and fall asleep like that, different story). \n\nI changed the settings but it didn't change anything. Then I thought \"okay maybe because I'm not online\" but once we arrived and I was back online, still nothing changed (even when I changed the settings once more). \n\nDays pass and I'm flying home again. First thing I do is boot up my computer and change the desktop settings as well. On other apps or games, sometimes having both desktop and mobile app, settings would confuse each other. So I thought okay, maybe that's the problem? But no. Still everything as (by now) usual. De- and reinstalling and reloging into my account in both mobile)\n\nIs it a bug? Am I stupid? What settings do I need to change? I just want clear breaks between my songs 😭😭 desktop didn't help either.",
    "created_utc": 1765896090.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1plc6jn",
    "title": "Bug? or mistake",
    "text": "https://preview.redd.it/a6mg272jbw6g1.png?width=172&format=png&auto=webp&s=e5c2665a6e06dce82b6a4c4016ceecae499852d2\n\nI was scrolling on spotify while listenting to Kali Uchis and I saw this from my podcast I saw it last second before switching tabs and said to myself \"No way that said 1970\" then when I went back it did say that is this like a bug or can the posters change the date?",
    "created_utc": 1765598835.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pdvvgl",
    "title": "Playing liked songs as a premium feature? (Bug?)",
    "text": "Tried to simply play my liked songs on iOS mobile (press play button) and I get this. Additionally, attempting to play any of my playlists results in the same issue. I think it's a bug- there's no way simply playing music can be premium? Anyone know how to correct this?\n\nhttps://preview.redd.it/xjcry7tsq55g1.png?width=1179&format=png&auto=webp&s=9500d748e2f9ecb76386e8d926206f6e2c211bc2\n\n",
    "created_utc": 1764841170.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pdgvn0",
    "title": "How can I report a functional bug to Spotify and showcase it in my portfolio?",
    "text": "Hi everyone, I'm a junior software tester (undergraduate). I recently found a functional bug in Spotify's desktop/web app and wrote a test case about it. My goal is to report this to Spotify effectively and also use this project to boost my CV. Does anyone know the best channel to reach their technical team? Also, any advice on how to best present this 'unsolicited' bug report to potential employers? Thanks!",
    "created_utc": 1764796861.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1k28tlz",
    "title": "Volume slider is bugged. On web browser, Edge and Firefox, Pip volume and main page volume doesn't match and when I refresh the page, it gets muted completely. When I try to increase volume, sometimes it doesn't",
    "text": "",
    "created_utc": 1744992958.0,
    "score": 21,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pgg3sv",
    "title": "Weird bug massively inflating local file numbers",
    "text": "Pretty much what the title says, I have 2035 files in the Spotify folder, but in the app, it says there are 3065 Local Files.\nTried clearing cache, downloads, turning the local files off, rebooting, and turning them back on.\nThat did, for a minute, fix the count back to 2035, but it went back to 3065 as soon as I clicked into a playlist to start redownloading.\nRunning on iOS 18.7.1",
    "created_utc": 1765106569.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1p4oj4w",
    "title": "Found this creepy bug after i changed my profile region, why does spotify do that?",
    "text": "The music in my playlist got swapped for some creepy slowed down edit with a different cover",
    "created_utc": 1763909397.0,
    "score": 9,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1p1ue94",
    "title": "So what's this bug about?",
    "text": "This started happening to my brother and I yesterday.\n\nWe're casting to Google Nest. It asks if I want to watch the video. The two options are either opening the song in my phone and cutting the cast, or not listening at all. Can't cast shit with this.\n\nIs this happening to anyone else, and does anyone know how to deal with it?",
    "created_utc": 1763614450.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1oho9au",
    "title": "Has anyone else been experiencing this bug?",
    "text": "Every time I try to pop out a song on my iOS to put it on repeat, it just gives me a black screen and then freezes the whole app. Is there anyway to fix this?",
    "created_utc": 1761593972.0,
    "score": 4,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1pbpmit",
    "title": "Local songs bugged on desktop",
    "text": "Im trying to enjoy listening to my liked song Playlist while playing games and whenever a local song come on spotify wont actually play the song, the song is stuck at 0:00. The songs work if clicked and will load the album and such its just when they come on in the queue they bug the player. The only work around I found is to skip foward and go back. But on top of that, once playing a local song and the queue goes back to non local songs it causes spotify to stop playing again. This is frustrating and doesn't make any sense im not sure if there is any work around for this to stop happening or what could be causing it. Anything helps, omky thing ive tried eas removing where I have the songs installed from the preference tab and adding them back in but it doesn't seem to help. I've also tried a fresh install and it doesn't help either, what else is there to be done?",
    "created_utc": 1764624957.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ohn7m8",
    "title": "Playlist search + bugs",
    "text": "So were all aware of how spotify lets you search playlists when you want to add music right? It's straight up not working for me.\n\nA few weeks before this, widgets werent working at all, and before that the app just refuses to load unless i closed it and restarted at least twice.\n\nIt seems theres a new problem every month for me.\n\nHow can i fix this other than uninstalling consistently?",
    "created_utc": 1761591625.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ooxuzg",
    "title": "Spotify Canvas (bug)...",
    "text": "I need your help...\nI can't get Canvas to work, I've tried everything:\nI turned off energy saving \nI uninstalled the app, then reinstalled it. \nI cleared the cache\nOf course I have the Canvas setting turned on\n\nBut nothing, none of this works and the Canvases continue to be deactivated...\nCould someone help me activate them or is it an update bug and therefore I can't activate them?\nThank you all so much in advance!",
    "created_utc": 1762332801.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1osyie0",
    "title": "unliking songs or visual bug?",
    "text": "So I've noticed recently that some of my songs are giving me the option to like them again even though they are already liked (when I search my liked songs for the song, it's there), which can get very confusing sometimes. I don't want to \"relike\" to fix this issue, because it will reset the date at which I liked the song, which I like to keep track of.",
    "created_utc": 1762731581.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1o3xbg5",
    "title": "how to fix the bug when i play one artist but it keeps puting other artists?",
    "text": "i have wierd bug, when i play one artist, like for an example ed sheeran, and i want to listen just his music, and it keeps puting other artists in there, like i click him, play his songs, but it keeps adding other, i dont have magic suffle on (i know magic suffle does that and its not turned on) and when i am listening him, it keeps changing and changing, i reseted the app, but no use, same goes again, i am using dekstop app",
    "created_utc": 1760193627.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ndc3nt",
    "title": "Spotify account completely bugged",
    "text": "I would loved literally any help since support is useless. My account is some sort of limbo where it exists on both my old phone and new phone but I can’t change or edit my email connected. Every time I try to login on a new device or click edit on my email on the places I’m logged in already it claims I don’t have an email connected at all. How can I fix this. I can’t even cancel premium cause it makes me go to my browser to do it and I won’t let me login. Kinda at a loss now since support just claims there’s nothing they can do since they claim my email in their system fine. Genuinely what can I do? ",
    "created_utc": 1757505282.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1nzdpzn",
    "title": "Is it just me or is the search feature kinda bugged",
    "text": "I was searching for a keyword but it wouldnt show me alot of results like it used to. The results feel very specific and less varied. I dont really know how to explain it, but I think the photos will explain it much better?\nnote: I am in online mode so I dont know whats going on",
    "created_utc": 1759740230.0,
    "score": 9,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1ogzequ",
    "title": "Spotify xbox bug",
    "text": "Is anyone else having issues where when u go to skip songs with the button \"y\" it just plays a random song, even when in a playlist?",
    "created_utc": 1761521697.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1o02e6p",
    "title": "Discover Weekly shows only 13–17 tracks instead of 30 (bug confirmed by Spotify support, still not fixed)",
    "text": "Hi everyone,  \nI’ve been having a weird issue with my *Discover Weekly* playlist for two weeks now. Instead of the usual 30 tracks, it only shows **13 tracks one week** and **17 the next**, sometimes with **duplicate songs by the same artist** (for example, 3 songs from ZZ Top and 3 from Gamma Ray this week).\n\nHere’s a summary of what happened:\n\n* I already contacted **Spotify Support**, and they **escalated my case** to the **highest level of customer support**.\n* They confirmed they see **30 tracks on their end**, but I (and even when checking through a VPN or test browsers) can only see 13–17.\n* I’ve **uninstalled/reinstalled** Spotify twice, **cleared cache**, **checked on different devices and connections**, and even tried the **test account** they gave me — which does show 30 tracks (but totally unrelated to my taste).\n* Support suggested I create a **new account** and transfer all my data, but that would mean losing **7 years of listening history and algorithm progress**, which is not an acceptable “fix.”\n* I’ve also noticed that Discover Weekly refreshes at **2 AM instead of midnight** now, and my **Release Radar** recently included **songs I’d already liked** months ago.\n\nSo it seems something’s broken in my account’s recommendation system — maybe a corrupted profile or algorithm bug.\n\nHas anyone else experienced the same?  \nDid creating a new account actually fix it, or is there another way to “reset” Discover Weekly without losing years of data?\n\nAny insight or confirmation from others would be really appreciated 🙏",
    "created_utc": 1759802825.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1mz7lc6",
    "title": "Why does my Spotify family plan keep bugging out?",
    "text": "Ever since I upgraded to the Spotify family plan, I’ve had people kicked off (recently EVERYONE got kicked off for no reason??, and before this everytime a different person joined, someone else would get kicked off) and this “Spotify Connect” joins the plan but isn’t a person… it takes up a spot but I have no idea what this is. What’s going on? And yes, everyone is under the same address and has the same address in their account settings.",
    "created_utc": 1756069784.0,
    "score": 9,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1olkypc",
    "title": "Bug during a change of description",
    "text": "When I try to change the description of one of my public playlists, it goes straight back to the old one... ",
    "created_utc": 1761994726.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1mk1fyd",
    "title": "Bugs in a jam with brother",
    "text": "I have been showing my brother the jam feature.  I sent him the link and we started to listen then it suddenly kept adding this same song over and over. It did not stop. I couldn't delete the song off the queue or play it. Any idea on how to fix this?",
    "created_utc": 1754576573.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1o2runp",
    "title": "Podcast Bug",
    "text": "I'm posting here because I couldn't find any help on Spotify's official channels to fix this. \nA couple of days ago, a podcast I was listening to stopped out of nowhere, and I haven't been able to play any of it since. It just keeps loading and can go on like this for hours. \nP.S.: Yes, I have already uninstalled and installed the app. ",
    "created_utc": 1760071960.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1o9vf8b",
    "title": "Spotify not adding songs to multiple playlists bug",
    "text": "So this has been bugging me to the point where I will probably stop using spotify if I can't find a consistent fix. In the app, when I add a singular song to multiple playlists at once, for some reason, now and again it will just decide to only add it to a fraction of the playlists I selected (I have approx 10 playlists I divided between mood and genre) and I won't be able to tell this has happened unless I go back into the song and check what playlists it has been added to. I'm currently trying to redo all my playlists and will potentially be adding thousands of songs so this will make adding songs a complete mess. \n\nFor instance I was adding 2 albums to my playlists the other day. In one album only 2 of the songs got messed up but in the other album EVERY song had only been added to some of the playlists that I had selected. \n\nTo give a clear example of what is happening, say I have this song I want to add, and I want to add it to playlist 1, 2, 3 and 4. The first time I add the song it'll only go into playlist 1. If I do it again it'll go into 1,2,3 and then if I do it again it'll finally go into all 4. Its a pain in the ass. \n\nPlease lemme know if you have had this issue and found a fix because I haven't been able to find much online about it.",
    "created_utc": 1760793074.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "tj1bm1",
    "title": "[BUG] Spotify desktop repeats segments of songs within the first 10 seconds. Problem appears on ~70% of the songs in my playlists. Is anyone else experiencing the same problem? Is there a solution?",
    "text": "",
    "created_utc": 1647829675.0,
    "score": 143,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1nufe5v",
    "title": "Having an issue on Spotify Xbox where my playlists are only showing ten songs when just a few days ago they were showing fifty (which I based my playlists around) and now my entire system is ruined, also happening is that I can't skip forwards past the tenth song, is this a known bug with any fixes?",
    "text": "",
    "created_utc": 1759244117.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1nuxf9y",
    "title": "Spotify bug",
    "text": "Does anyone else experience that Xbox Spotify only shows 10 songs from their playlist?",
    "created_utc": 1759288494.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1nlxj8r",
    "title": "need help with this bug.",
    "text": "Iv enabled the new auto mix feature in settings, yet the option won’t pop up in my own playlists. any idea how to fix this?",
    "created_utc": 1758373137.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1o5nirc",
    "title": "Spotify Bug",
    "text": "i have the thing where you can like change the sound transitions but only on mobile. i got it on pc too but the problem is i can edit it. but there is still this message that it comes soon \n\n  \nhas anyone problems with that?",
    "created_utc": 1760370756.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1npmds2",
    "title": "Help my Spotify big bugging",
    "text": "As you can see i have a sad song playing and it’s trying to play rap next and it does that no matter what unless I click a playlist. I used to click a song and it would give more songs like that after now I click a song n it doesn’t matter what type of song rap always play after Please help n give solutions ",
    "created_utc": 1758744046.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "bug"
  },
  {
    "id": "1fl2uim",
    "title": "Someone at customer support wasn’t happy  😓",
    "text": "I’m always on the employee’s side bc I know how draining customer service is, but come on, there was no reason to feel uncomfortable lol\nI even thank him and all",
    "created_utc": 1726802981.0,
    "score": 3732,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1kvx6gw",
    "title": "My Spotify account randomly got banned and the customer support experience made it worse.",
    "text": "I’m writing this post out of frustration and sadness. My Spotify account, which I’ve been using for the last 4–5 years and am deeply attached to, has suddenly stopped working. Today, without any warning, I found that I couldn’t access any of my playlists, and my entire library appeared empty.\nSo, today was wild. I opened my Spotify account and boom—nothing worked. I thought it was just a temporary glitch, so I did all the usual stuff—reinstalled the app, logged out and logged back in, even submitted my account for deletion and recovery. Nothing helped.\n\nEventually, I decided to contact Spotify Customer Care (thanks to a recommendation I had earlier). I was greeted by a bot, who then connected me to a real person. Here’s where it gets interesting.\n\nThe support rep asked for my email, my phone number, and my username. I provided everything. Then she casually dropped, “Your account has been accidentally banned.” I was like, okay, weird, but at least you know the problem—how do I fix it? But before I could ask anything more, she just ended the conversation. Gone. Vanished.\n\nI was annoyed, obviously, but tried again. This time, the bot gave me a list of common issues. I picked one that fit best, hoping it would help. When I went back to that link hoping that it could help now it shows me the screenshot that you are banned for breaching our community guidelines. \n\nSo, I tried contacting support again and got connected to another rep. This one told me my account is banned—but refused to give me any reason. I asked, What did I do? I didn’t violate any guidelines. He said, “Sorry, can’t tell you. It’s against our policy.” And before I could ask anything else—he ended the chat. Just like that.\n\nNo explanation. No help. Just… banned.\n\nI’m just here wondering: how does a paying user get treated like this? Anyone else faced something similar?",
    "created_utc": 1748273227.0,
    "score": 268,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nf17py",
    "title": "I’m John, engineering manager at Spotify. I helped develop the Lossless feature. AMA!",
    "text": "Hey all!\n\nI’m John, an engineering manager at Spotify, and for the past couple of years, I’ve been a part of the team working on Spotify Lossless. It’s finally rolling out in Premium, and I’m here to do an **AMA on Friday, September 12th from 10am-11am ET** to answer your questions about how it works, what exactly it is, what to expect as it rolls out, and more.\n\nA little about me: I’ve been at Spotify for 7 years, working on the consumer UX side of things. Basically, I care HUGELY about delivering software that people will love. That’s what motivates me. Lossless has been one of the most exciting (and challenging!) projects I’ve worked on, and I’m really proud of what our team has built.\n\nSo today, ask me anything about:\n\n* How Lossless streaming works\n* Supported devices, data use, storage, or sound quality\n* The UX experience\n* And even some Lossless trivia!\n\nCan’t wait to chat and geek out about audio quality with you all 🎧\n\n \\- John, Spotify Engineering Manager\n\n\\--\n\n**Update:** Sorry all, tried to stay on a little longer but have to run now! Can I leave you with a true story that there was a moment in this project where we had a typo and launched \"ossless\" to all our team. So for a few hours, everyone internally was streaming in full \"ossless\" 🤣 Still sounded great though... In all seriousness, thank you all so much for all the questions. It was great to celebrate the launch of Lossless with you all 💚\n\nhttps://preview.redd.it/cdul1sle1qof1.jpg?width=3024&format=pjpg&auto=webp&s=70aaeb8ace2e815137b6a11ed64cd3d30dad09f9",
    "created_utc": 1757678233.0,
    "score": 1598,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "17u6smx",
    "title": "Spotify support says HiFi is coming very soon",
    "text": "&#x200B;\n\n[I know they are telling the same but i can't stop hoping for it 😭](https://preview.redd.it/n28rsyhxz20c1.png?width=393&format=png&auto=webp&s=b326d185756c876791633c01d5c6692bd8e607bd)",
    "created_utc": 1699866614.0,
    "score": 232,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ppeoqi",
    "title": "Account of almost 10 years banned for no reason and support doesn't care?",
    "text": "I apologize if this isn't the right place to post this but I'm not sure where else to go and the whole situation just has me really upset. \n\nI just got home and noticed I've been signed out of Spotify and it says there's no account associated with my email. So I contact support and they notify me that my account has been permanently disabled and there's nothing they can do about it even though I've had the same account for almost 10 years, thousands of playlists, and I've been a premium member for the last several years . I had to contact multiple support agents and the closest I could get to a reason for my ban was \"dangerous/harmful content\" but nobody could give me a specific reason and they all say there's absolutely no option than to make a new account with a new email. I rarely put names/covers on my playlists and my profile picture was just a dog so I'm having a hard time figuring out what I could have done to violate their terms and conditions.\n\n  \nAm I truly completely out of options like support says? All of this has me devastated and I don't really know where to go from here now that I've had almost a decades worth of my listening history erased, so any advice on appeals or alternate services would be immensely appreciated.",
    "created_utc": 1766022746.0,
    "score": 29,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1o5go5t",
    "title": "Spoitfy PC version now supports custom random playback",
    "text": "https://preview.redd.it/y2yrkmbg2vuf1.png?width=1595&format=png&auto=webp&s=34f3a4c641f54fb3b028471eecb9ac48f3fc3676\n\n",
    "created_utc": 1760353431.0,
    "score": 96,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1puxo09",
    "title": "Lossless not supported on Pioneer Elite receiver",
    "text": "I have a Pioneer SX-S30 which is supposed to support lossless formats, but when I pick it in the Spotify app it says only “Very high” quality is supported. I already updated the firmware.\n\nDoes anyone have this receiver or another Pioneer receiver and got Spotify lossless working? I searched and all generic responses is that it should and to update the firmware. \n\n",
    "created_utc": 1766611286.0,
    "score": 11,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nwxcct",
    "title": "Devices supporting lossless Spotify Connect (as a sink/target)?",
    "text": "Is there a list somewhere of streaming boxes supporting lossless Spotify Connect as the destination for such streams.  I.e. something I can connect to my receiver/DAC and will play lossless streams I select from my iOS phone app as a remote?  Needs to have a digital output (though usb might be sufficient if it supports a USB DAC).",
    "created_utc": 1759493358.0,
    "score": 7,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1phv2fd",
    "title": "Spotify support",
    "text": "I genuinely wish that there was some way I could get back the 3 hours I spent trying to contact Spotify support. Please tell me why it was like talking to a brick wall? I genuinely just am curious as to if I'm the only one who's had this experience with them. I threw the law at them and they panicked and didn't know how to handle my issue. Tell me why they were literally telling me that they're breaching the Consumer Rights Act 2015? Tell me why they apparently have no circumstances when they can provide a refund? I just wish there was a place I could go to to complain about them, I'm a law student and they were telling me the law doesn't apply to them?? 😖\n\nEdit: I got a refund!!! ",
    "created_utc": 1765244962.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1lx9ezn",
    "title": "For those that are started to feel bad for supporting Ek, Bandcamp IS an option, you know. So many people feel stuck in their system, and that's where they want you.",
    "text": "",
    "created_utc": 1752246714.0,
    "score": 21,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1b3yqb5",
    "title": "Spotify’s new audiobook tier will only save you a dollar over Premium. Includes ad-supported music and podcasts.",
    "text": "",
    "created_utc": 1709311106.0,
    "score": 159,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nj7cxq",
    "title": "Check whether the account supports lossless",
    "text": "https://preview.redd.it/pll9cz63popf1.png?width=917&format=png&auto=webp&s=dcc0269d9890e802813ba8f2585bf2ce3cf64b5c\n\nIt seems that you can check whether your account has received the push of lossless function through the DevTools-Playback-Connect interface",
    "created_utc": 1758097145.0,
    "score": 48,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ppxzi3",
    "title": "Spotify is a joke. 2 hours of customer support to be told 'everything is fine' when I keep having card declines. Just take my money and stop wasting my time.",
    "text": "This is the 3rd time I've had to do this.\n\nAs I was entering my 2nd hour of messaging my bank and spotify customer support, being told by both that there are clearly no problems with my account or with my card, I realized something. What am I doing? Have I gone insane? Spotify needs to get their shit together and quit wasting my time. I either get absolutely earfucked by 3 ads at a time or waste hours of time every month trying to make a payment. I'm absolutely over it and have no idea why I've even been submitting myself to this much bullshit.\n\nIf they don't want to take my money it's not my fucking problem.\n\nI'm sure Apple Music or the 10 other music streaming platforms will gladly charge my card.\n\nEdit: Signed up for Youtube Music. Took literal seconds. Get fucked Spotify.",
    "created_utc": 1766081982.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1p87c0x",
    "title": "When will spotify support new iOS 26 keyboard?",
    "text": "It has the legacy keyboard still and it’s been two months now since iOS 26 came out and they still don’t have the new keyboard ",
    "created_utc": 1764263007.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1pe4ct6",
    "title": "How I get the my music tab in Spotify support says I’m logged in as a listener.",
    "text": "",
    "created_utc": 1764865517.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1pchlnl",
    "title": "Spotify app on android stopped working, support is non-existent wtaf",
    "text": "I opened the app the other day and it started skipping songs. One per second. And when I tried opening my main ​playlist there is now ONE song there. Wtaf. Resetting, restarting, reinstalling doesn't work. \n\nNow when I start the app it just says \"something went wrong\". \n\nTried to fin​d support. All I found was a support community(!?) where I cannot find a way to post. No chat. No email. Nothing.\n\nSo I lost all my songs, all my playlists, and there seems to be no way t​o fix it. Should I just give up? Any ideas? I am amazed this app is something I am expected to pay for.   \n",
    "created_utc": 1764703025.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ns7ege",
    "title": "There is no technical support for Spotify? (Not able to use Lossless)",
    "text": "I do not have the option on my Spotify to set the audio quality to Lossless.\n\nI have studio equipment, everything is fine and top-notch.\n\nI uninstalled and reinstalled Spotify because I was sure it was something with me. But I still don't have the option for Lossless, for Mixing playlists, it works, and I have the new feature.\n\nI randomly asked a friend to check his account to see if he can use Lossless, if he has it, and if it works, he has it. (and for some reason, his Spotify looks different; I don't know why)\n\n\n\nI need help. I have a premium account and everything.",
    "created_utc": 1759009921.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1p4svr4",
    "title": "Any roadmap or timeline for exclusive mode or asio support?",
    "text": "Anyone knows about timeline or roadmap for asio  or exclusive mode support for windows app for true lossless listening.",
    "created_utc": 1763919799.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ovgzb3",
    "title": "Where can i get actual support? Not a support question i think? remove this if im breaking rules.",
    "text": "# [](https://www.reddit.com/r/spotify/?f=flair_name%3A%22Discussion%20%2F%20Playlist%20Questions%22)I need to get support for an issue, but the support sub is dead and makes me request to post. the stupid ai bot does nothing, and i cant create a new account to talk to someone over the support chat, (Because of my issues.) is there anywhere i can go to get support? is here somewhere i can get support?",
    "created_utc": 1762980441.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1md3i6c",
    "title": "Spotify has also started age verification",
    "text": "",
    "created_utc": 1753873125.0,
    "score": 936,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nhlvwq",
    "title": "Are there plans to roll out lossless audio support on Linux?",
    "text": "Just noticed that there was an [AMA](https://www.reddit.com/r/truespotify/comments/1nf17py/im_john_engineering_manager_at_spotify_i_helped/) this week but I didn't see any reference regarding the Linux [client](https://www.spotify.com/de-en/download/linux/).\n\nHave there been any discussions around adding support in the near future?\n\n\\-----------------\n\nEdit:  Looks they've just rolled out support.  ",
    "created_utc": 1757942973.0,
    "score": 14,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1oh7du4",
    "title": "Does spotify now support local flac files",
    "text": "I want to know whether the new update changed how locally added flac files work on spotify as when i try and play a flac file and check the playback quality it just says automatic quality and not that it's playing in 16 bit 44kHz ",
    "created_utc": 1761547096.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ka7hxc",
    "title": "Spotify Support Refuses to Let Me Add Daughter Back to Family Plan - Cites Undefined \"Automatic Protection\"",
    "text": "Just had an incredibly frustrating \\~2-hour chat session with Spotify support and need to vent/see if anyone else has experienced this absurdity.\n\n\n\nTL;DR: I accidentally removed my daughter from our paid Spotify Premium Family plan on Friday. She lives in the same house. Now, when she tries to accept the invite, she gets an error: \"Find another Premium plan that's right for you\". Support confirmed my account is fine, but says an unexplainable, un-overrideable \"automatic protection\" prevents her (or maybe anyone?) from rejoining my plan, and their solution is for her to get her own plan or for me to find a different plan.\n\n\n\nThe Saga:\n\n\n\nThe Problem: Accidentally removed my daughter from the Family Plan. Sent a new invite. She lives with us, same address. Clicking the invite leads to the error mentioned above.\n\nContact Support: Got connected, explained the situation.\n\nAgent 1 (Thomas): After checking, tells me \"due to some security reasons she cannot join the plan.\" Later clarifies: \"The account is prevented from doing so due to an automatic protection which we can't override. Unfortunately, we don't have any further details regarding this.\" His suggestion? She should get her own Premium plan or join a different Family Plan. Seriously? I'm already paying for this one and have open slots!\n\nAgent 2 (Benny): After Thomas disconnected/timed out, Benny picked up. He seemed more helpful initially. Checked things out, confirmed my account/plan was fine (\"Upon checking as I can see your account is fine and there is no issues on your account.\"). Asked for confirmation of my email and my daughter's email, making it seem like he might actually be able to do something.\n\nAgent 3 (Jaden C): Benny timed out/disconnected. Jaden C takes over. After reviewing, he completely reverts to the original script: \"I am afraid that, as mentioned previously, we can confirm that you won't be able to invite a new member to your current Family plan. The account is prevented from doing so due to an automatic protection which we can't override. Unfortunately, we don't have any further details regarding this.\"\n\nThe \"Resolution\": When I asked what I'm paying for, if cancelling and restarting the plan would work, or what this \"protection\" even is, the response was: \"Unfortunately, we don't have any further details regarding this. We recommend finding another Premium plan that's right for you.\"\n\nSo, Spotify's official stance is that even though I pay for a Family Plan, and accidentally removed a member who lives with me, some secret \"automatic protection\" means I can't add them back, they can't tell me why, they can't fix it, and their advice is basically \"buy another plan\"? This feels completely unacceptable for a paying customer. I have empty slots I'm paying for!\n\n\n\nHas anyone else run into this mysterious \"automatic protection\"? Is there any known fix or escalation path? Or is Spotify really telling paying customers tough luck, buy more stuff, because our system flagged something we won't explain?\n\n\n\nAbsolutely infuriating. Thinking it might finally be time to check out Apple Music or YouTube Music if this is how they treat loyal customers.",
    "created_utc": 1745876636.0,
    "score": 6,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1njighl",
    "title": "Lossless shows up but it says my device doesn’t support lossless.",
    "text": "I got a pop up saying the device doesn’t support lossless not support lossless, try changing your device. I’m trying to play it on an iPhone to my bluesound node through Spotify connect. Does anyone know why?",
    "created_utc": 1758127733.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1o02e6p",
    "title": "Discover Weekly shows only 13–17 tracks instead of 30 (bug confirmed by Spotify support, still not fixed)",
    "text": "Hi everyone,  \nI’ve been having a weird issue with my *Discover Weekly* playlist for two weeks now. Instead of the usual 30 tracks, it only shows **13 tracks one week** and **17 the next**, sometimes with **duplicate songs by the same artist** (for example, 3 songs from ZZ Top and 3 from Gamma Ray this week).\n\nHere’s a summary of what happened:\n\n* I already contacted **Spotify Support**, and they **escalated my case** to the **highest level of customer support**.\n* They confirmed they see **30 tracks on their end**, but I (and even when checking through a VPN or test browsers) can only see 13–17.\n* I’ve **uninstalled/reinstalled** Spotify twice, **cleared cache**, **checked on different devices and connections**, and even tried the **test account** they gave me — which does show 30 tracks (but totally unrelated to my taste).\n* Support suggested I create a **new account** and transfer all my data, but that would mean losing **7 years of listening history and algorithm progress**, which is not an acceptable “fix.”\n* I’ve also noticed that Discover Weekly refreshes at **2 AM instead of midnight** now, and my **Release Radar** recently included **songs I’d already liked** months ago.\n\nSo it seems something’s broken in my account’s recommendation system — maybe a corrupted profile or algorithm bug.\n\nHas anyone else experienced the same?  \nDid creating a new account actually fix it, or is there another way to “reset” Discover Weekly without losing years of data?\n\nAny insight or confirmation from others would be really appreciated 🙏",
    "created_utc": 1759802825.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1du5sxk",
    "title": "Spotify removes Russian artists who support Ukraine war",
    "text": "",
    "created_utc": 1719981297.0,
    "score": 110,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nxaixl",
    "title": "Support question--how do I delete songs that were removed by spotify but still show up in my playlist?",
    "text": "On my phone it says I have more songs/podcasts than it shows on my playlist. Meaning, I believe that some songs and podcasts were deleted by spotify, but still, for some reason, show up in my total songs on my playlist. \n\nFor example, I just have one podcast I can see on my playlist--but it states I have 6. So I assume Spotify made the original uploader of the podcast remove the song. But my playlist still says it's on there! I want to take these off so the number more accurately represents my playlist. \n\nI know there was a way which I used to see the removed songs (they were grayed out) and I could delete them from my computer. But even on my computer it doesn't show these removed songs. \n\nIs there a way in settings to turn on this feature? I want the number of songs to reflect my playlist accurately. ",
    "created_utc": 1759523968.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nv8p88",
    "title": "Student plan added in Bosnia today but doesnt work. Support doesnt know anything",
    "text": "Student plan was launched today in Bosnia. It doesnt work.\n\n I verified my student status. Whenever I choose the student plan option, I get the message in pic 2, when i click choose plan it takes me to the previous page to choose a plan. And then the process repeats over and over again.\n\nSupport doesnt know anything and keeps sending me the link for a US student offer, the Bosnian link is broken.\n\nSame thing with other Balkan countries which got the student plan today, so its Spotify issue  ",
    "created_utc": 1759326509.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1o3xbsa",
    "title": "Spotify Support is awefull (especially with a tought problem)",
    "text": "So I have a pretty specific and weird problem with my Spotify.  \nWhenever I start a playlist, it cycles through 3–10 songs until it stops. But then it only plays for 9 seconds and goes quiet after that.  \nAnyway, so I had this problem a few months back, but it fixed itself. Three months ago it came up again, but I didn’t care much since I didn’t use Spotify anyway. But two weeks ago I thought maybe I could fix it, so I searched it up online and found nothing. So I went to Spotify Support and asked them through chat.  \nAfter four supporters, I found one who actually helped me and didn’t just tell me to restart my computer and clear cache (I even set up Windows in the meantime and had the same problem on multiple devices).  \nSince they couldn’t help me, they told me that the \"Technical Support\" would help me. Long story short I got told three times to clear cache and reinstall the app (I use the web version only).  \nNow the cherry on top: The support greeted me with the name of the support member I originally wrote to — it’s straight-up AI.\n\nIf anyone is better than the original Spotify Support, please let me know if you know how I can fix my problem.\n\nAnyways, looks like im switching to mp3 playlist lol",
    "created_utc": 1760193652.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1m7fuf5",
    "title": "Spotify terminated my account without notice",
    "text": "Reached out to support twice but got the same canned response. Any one else?\n\n\n",
    "created_utc": 1753292502.0,
    "score": 984,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1m0q9pl",
    "title": "Spotifys support team are clueless people",
    "text": "I’ve had this issue where the song ‘punk rocker’ with iggy pop in has completely vanished from my Spotify, like it’s nowhere, on the album for the superman soundtrack it’s literally missing from it\n\nWhen my friends send the link to the song it just brings me to the album \n\nI’ve been in a chat with Spotify support for two hours now and 7 people have been unable to fix my issue, even though they’re just telling me to do the same stuff but in a different way\n\nI’m losing my mind ",
    "created_utc": 1752605524.0,
    "score": 10,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nrgsiu",
    "title": "Mix: Not supported on Sonos?",
    "text": "Is the mix feature not supported on Sonos (I haven't tried other speakers) ? I get the transitions on my phone, then I switch to playing from my Sonos and the mixing goes away entirely. Via Spotify-connected (wifi) speaker btw, not Bluetooth.\n\nHaven't seen any mention of this elsewhere.",
    "created_utc": 1758930897.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1mv6etq",
    "title": "Missing customer support?",
    "text": "Honest question: I purchased a subscription to Premium, but it got lost (went through the dumb browser instead of in app). How is it possible to access customer support?",
    "created_utc": 1755668603.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nqxfzg",
    "title": "Quick tip for sorting playlists on desktop by BPM until official sorting support is provided",
    "text": "If you are manually sorting like I do, you can do the following:\n\n1. Select all tracks in a certain BPM range (e.g: 100-110)\n2. Move them all into a single section\n3. Do the same for subsequent BPM ranges (e.g: 110-120, 120-130, etc.)\n4. Sort manually on the created blocks\n\nHope this helps someone. 👍",
    "created_utc": 1758881307.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1nl4086",
    "title": "Support for local FLAC files in the Linux client",
    "text": "Hello everyone\n\nThe Spotify client for Linux has had a problem for years: it doesn't support local files in FLAC format. The client for all other operating systems does support this\n\n I'm asking for your help by [voting on this proposal](https://community.spotify.com/t5/Live-Ideas/Support-for-local-FLAC-files-for-the-linux-client/idi-p/7138634).\n\nAnd by [liking this article](https://community.spotify.com/t5/Desktop-Linux/Local-flac-files-do-not-appear-in-my-library-on-Linux/td-p/5324594).",
    "created_utc": 1758289529.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1d35ti5",
    "title": "Spotify support is the worst I've ever experienced.",
    "text": "I had an issue with my account, so I went to the support page to resolve it. I provided all the necessary details and information as requested by the support representative. Despite this, they didn't respond properly, asked unrelated questions like if I was an artist, and repeatedly closed the chat without any further explanation. This forced me to start the process over six times.\n\nEach time, I had to explain my issue from the beginning, which was frustrating and time-consuming. The lack of continuity and understanding from the support team made the experience even more aggravating. Their inability to address my problem or provide a clear solution left me feeling ignored and undervalued as a customer. I expected better from a service as popular and reputable as Spotify.",
    "created_utc": 1716965266.0,
    "score": 50,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1n29vbi",
    "title": "How do I contact support without login",
    "text": "cant login to spotify as when logging in it says email isn't linked to spotify but when I sign up it says it is and it doesnt let me login with google then when I clicked the link to talk with support it asks me to login",
    "created_utc": 1756381138.0,
    "score": 1,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ja1bz0",
    "title": "since spotify is supporting andrew tate, has anyone else deleted their spotify account?",
    "text": "i have",
    "created_utc": 1741831478.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ljv4q6",
    "title": "Trying to make support laugh",
    "text": "",
    "created_utc": 1750821518.0,
    "score": 25,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1lm15hf",
    "title": "Spotify Support Says: \"It's not ideal, but I'm afraid this isn't something we can help with\" in regards to Artists selling playlist placements, bot streams, etc.",
    "text": "",
    "created_utc": 1751048561.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1d0hn1y",
    "title": "(Car Thing) Spotify is offering refunds to those who reach out to support",
    "text": "I only had to provide my original receipt and account email.  ",
    "created_utc": 1716659981.0,
    "score": 213,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ky8y2k",
    "title": "support is completely useless",
    "text": "**I got logged out of my Spotify account on all my devices. When I tried to log back in, it said:**  \n**\"Email or username isn't linked to a Spotify account.\"**\n\nI'm still paying for Premium until July I just used one of their 2-month discount offers.\n\nSo I contacted Spotify support. At first, they said they'd help me regain access, but like 5 minutes later they suddenly told me the account is on Free and that my email hasn't changed.  \nSo I asked: *“If that's true, then why can't I log in at all?”*\n\nAnd their answer? *“We can't help. Just create a new account.”*\n\nI opened multiple support chats, hoping to find someone who actually understands what’s going on but they kept closing the chat giving me no time to answer, even though I wrote “please don’t close the chat” after every message.\n\nIs there **any** way to get my account back or am I screwed?",
    "created_utc": 1748519925.0,
    "score": 3,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1m3ks6c",
    "title": "This is horrible - I have never listened or supported this song/ artists. And Spotify is saying its an artist I 'love'. Promotional without saying, and we pay them monthly too.",
    "text": "",
    "created_utc": 1752891482.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1g1blt9",
    "title": "Just got back from Spotify Support and it was a disaster...",
    "text": "",
    "created_utc": 1728658252.0,
    "score": 0,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1kwg3ny",
    "title": "Spotify for Artists support is useless",
    "text": "My artists has been dropping music for the last 3 years on Spotify. Over a year ago our numbers started going crazy and we were looking into claiming his Spotify for Artist, which we weren’t able to because someone had previously claimed it and started mocking us in the bio (strange world these days). After trying to contact Spotify for Artists multiple times about this issue with all the needed information that we are the ones dropping all the music under that name, they told us to contact the person which is mocking us with an offensive bio.\n\nHow do you expect us to claim our profile and make it look professional for our upcoming label deal, when someone is already in there? We don’t even know the person so how am i even able to get in contact like support told us to do?",
    "created_utc": 1748326211.0,
    "score": 7,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1ljnox5",
    "title": "Am I the only one who’s actually had a good experience with the advisors at Spotify Support?",
    "text": "Just interested to hear your thoughts. They actually helped ease my anxiety a lot on a situation I was having ",
    "created_utc": 1750800783.0,
    "score": 2,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1leb729",
    "title": "Spotify account hacked, support wont help (lying)",
    "text": "Hi all, I was suddenly logged out of my Spotify account, and when I tried to log in it said email was not registered. I went to my email and got two emails for suspected login attempts and the password change link, but when I clicked it the link was not working or used. I tried contacting support, but the response was not helpful at all and seems like a blatant lie. The support agent said that the account was disabled for security purposes and I'd need to register for a new account, but this is a blatant lie as I can still access my spotify profile from another account, and the recently played music is not something that I was listening to. Is there any solution here? I smell something fishy is going on\n\nhttps://preview.redd.it/e7m97hga4n7f1.png?width=1489&format=png&auto=webp&s=8c20a3081cac2c3124c59714d36f5ecce1f92737\n\nhttps://preview.redd.it/maygylob4n7f1.png?width=393&format=png&auto=webp&s=29645c1d4e87a75d0faea7cd5ac47f92667c43af\n\n",
    "created_utc": 1750232594.0,
    "score": 6,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1iidsf1",
    "title": "Spotify for Artist Support",
    "text": "I had one of my singles taken down twice for “artificial streams” I had asked my distributors for help, and the first time it was placed back up. And then suddenly it was offline again. This was the first conversation I had with my distributor. They then proceeded to ghost me. Moral of the story I know now that this isn’t a distributor issue, and it is a spotify issue. Is there anyway to contact support for artists? And I’m unsure if this is the right subreddit to ask either. Thank you.",
    "created_utc": 1738772370.0,
    "score": 16,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1bzjigd",
    "title": "Here it comes",
    "text": "",
    "created_utc": 1712637485.0,
    "score": 975,
    "subreddit": "truespotify",
    "keyword": "support"
  },
  {
    "id": "1pxro5j",
    "title": "What the hell is this supposed to mean?",
    "text": "I wanted to purchase 3-month free premium however the spotify kept reject my card. I asked support and here is the outcome. I could not understand what this is supposed to mean.",
    "created_utc": 1766929435.0,
    "score": 361,
    "subreddit": "truespotify",
    "keyword": "support"
  }
]